Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_cachedata.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; nrf5340_application_cachedata.
; ==============================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     nrf5340_application_cachedata equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// CACHEDATA address definitions
// -----------------------------

typedef struct {
    volatile    uint32_t    SET0_WAY0_DATA0;
    volatile    uint32_t    SET0_WAY0_DATA1;
    volatile    uint32_t    SET0_WAY0_DATA2;
    volatile    uint32_t    SET0_WAY0_DATA3;
    volatile    uint32_t    SET0_WAY1_DATA0;
    volatile    uint32_t    SET0_WAY1_DATA1;
    volatile    uint32_t    SET0_WAY1_DATA2;
    volatile    uint32_t    SET0_WAY1_DATA3;
    volatile    uint32_t    SET1_WAY0_DATA0;
    volatile    uint32_t    SET1_WAY0_DATA1;
    volatile    uint32_t    SET1_WAY0_DATA2;
    volatile    uint32_t    SET1_WAY0_DATA3;
    volatile    uint32_t    SET1_WAY1_DATA0;
    volatile    uint32_t    SET1_WAY1_DATA1;
    volatile    uint32_t    SET1_WAY1_DATA2;
    volatile    uint32_t    SET1_WAY1_DATA3;
    volatile    uint32_t    SET2_WAY0_DATA0;
    volatile    uint32_t    SET2_WAY0_DATA1;
    volatile    uint32_t    SET2_WAY0_DATA2;
    volatile    uint32_t    SET2_WAY0_DATA3;
    volatile    uint32_t    SET2_WAY1_DATA0;
    volatile    uint32_t    SET2_WAY1_DATA1;
    volatile    uint32_t    SET2_WAY1_DATA2;
    volatile    uint32_t    SET2_WAY1_DATA3;
    volatile    uint32_t    SET3_WAY0_DATA0;
    volatile    uint32_t    SET3_WAY0_DATA1;
    volatile    uint32_t    SET3_WAY0_DATA2;
    volatile    uint32_t    SET3_WAY0_DATA3;
    volatile    uint32_t    SET3_WAY1_DATA0;
    volatile    uint32_t    SET3_WAY1_DATA1;
    volatile    uint32_t    SET3_WAY1_DATA2;
    volatile    uint32_t    SET3_WAY1_DATA3;
    volatile    uint32_t    SET4_WAY0_DATA0;
    volatile    uint32_t    SET4_WAY0_DATA1;
    volatile    uint32_t    SET4_WAY0_DATA2;
    volatile    uint32_t    SET4_WAY0_DATA3;
    volatile    uint32_t    SET4_WAY1_DATA0;
    volatile    uint32_t    SET4_WAY1_DATA1;
    volatile    uint32_t    SET4_WAY1_DATA2;
    volatile    uint32_t    SET4_WAY1_DATA3;
    volatile    uint32_t    SET5_WAY0_DATA0;
    volatile    uint32_t    SET5_WAY0_DATA1;
    volatile    uint32_t    SET5_WAY0_DATA2;
    volatile    uint32_t    SET5_WAY0_DATA3;
    volatile    uint32_t    SET5_WAY1_DATA0;
    volatile    uint32_t    SET5_WAY1_DATA1;
    volatile    uint32_t    SET5_WAY1_DATA2;
    volatile    uint32_t    SET5_WAY1_DATA3;
    volatile    uint32_t    SET6_WAY0_DATA0;
    volatile    uint32_t    SET6_WAY0_DATA1;
    volatile    uint32_t    SET6_WAY0_DATA2;
    volatile    uint32_t    SET6_WAY0_DATA3;
    volatile    uint32_t    SET6_WAY1_DATA0;
    volatile    uint32_t    SET6_WAY1_DATA1;
    volatile    uint32_t    SET6_WAY1_DATA2;
    volatile    uint32_t    SET6_WAY1_DATA3;
    volatile    uint32_t    SET7_WAY0_DATA0;
    volatile    uint32_t    SET7_WAY0_DATA1;
    volatile    uint32_t    SET7_WAY0_DATA2;
    volatile    uint32_t    SET7_WAY0_DATA3;
    volatile    uint32_t    SET7_WAY1_DATA0;
    volatile    uint32_t    SET7_WAY1_DATA1;
    volatile    uint32_t    SET7_WAY1_DATA2;
    volatile    uint32_t    SET7_WAY1_DATA3;
    volatile    uint32_t    SET8_WAY0_DATA0;
    volatile    uint32_t    SET8_WAY0_DATA1;
    volatile    uint32_t    SET8_WAY0_DATA2;
    volatile    uint32_t    SET8_WAY0_DATA3;
    volatile    uint32_t    SET8_WAY1_DATA0;
    volatile    uint32_t    SET8_WAY1_DATA1;
    volatile    uint32_t    SET8_WAY1_DATA2;
    volatile    uint32_t    SET8_WAY1_DATA3;
    volatile    uint32_t    SET9_WAY0_DATA0;
    volatile    uint32_t    SET9_WAY0_DATA1;
    volatile    uint32_t    SET9_WAY0_DATA2;
    volatile    uint32_t    SET9_WAY0_DATA3;
    volatile    uint32_t    SET9_WAY1_DATA0;
    volatile    uint32_t    SET9_WAY1_DATA1;
    volatile    uint32_t    SET9_WAY1_DATA2;
    volatile    uint32_t    SET9_WAY1_DATA3;
    volatile    uint32_t    SET10_WAY0_DATA0;
    volatile    uint32_t    SET10_WAY0_DATA1;
    volatile    uint32_t    SET10_WAY0_DATA2;
    volatile    uint32_t    SET10_WAY0_DATA3;
    volatile    uint32_t    SET10_WAY1_DATA0;
    volatile    uint32_t    SET10_WAY1_DATA1;
    volatile    uint32_t    SET10_WAY1_DATA2;
    volatile    uint32_t    SET10_WAY1_DATA3;
    volatile    uint32_t    SET11_WAY0_DATA0;
    volatile    uint32_t    SET11_WAY0_DATA1;
    volatile    uint32_t    SET11_WAY0_DATA2;
    volatile    uint32_t    SET11_WAY0_DATA3;
    volatile    uint32_t    SET11_WAY1_DATA0;
    volatile    uint32_t    SET11_WAY1_DATA1;
    volatile    uint32_t    SET11_WAY1_DATA2;
    volatile    uint32_t    SET11_WAY1_DATA3;
    volatile    uint32_t    SET12_WAY0_DATA0;
    volatile    uint32_t    SET12_WAY0_DATA1;
    volatile    uint32_t    SET12_WAY0_DATA2;
    volatile    uint32_t    SET12_WAY0_DATA3;
    volatile    uint32_t    SET12_WAY1_DATA0;
    volatile    uint32_t    SET12_WAY1_DATA1;
    volatile    uint32_t    SET12_WAY1_DATA2;
    volatile    uint32_t    SET12_WAY1_DATA3;
    volatile    uint32_t    SET13_WAY0_DATA0;
    volatile    uint32_t    SET13_WAY0_DATA1;
    volatile    uint32_t    SET13_WAY0_DATA2;
    volatile    uint32_t    SET13_WAY0_DATA3;
    volatile    uint32_t    SET13_WAY1_DATA0;
    volatile    uint32_t    SET13_WAY1_DATA1;
    volatile    uint32_t    SET13_WAY1_DATA2;
    volatile    uint32_t    SET13_WAY1_DATA3;
    volatile    uint32_t    SET14_WAY0_DATA0;
    volatile    uint32_t    SET14_WAY0_DATA1;
    volatile    uint32_t    SET14_WAY0_DATA2;
    volatile    uint32_t    SET14_WAY0_DATA3;
    volatile    uint32_t    SET14_WAY1_DATA0;
    volatile    uint32_t    SET14_WAY1_DATA1;
    volatile    uint32_t    SET14_WAY1_DATA2;
    volatile    uint32_t    SET14_WAY1_DATA3;
    volatile    uint32_t    SET15_WAY0_DATA0;
    volatile    uint32_t    SET15_WAY0_DATA1;
    volatile    uint32_t    SET15_WAY0_DATA2;
    volatile    uint32_t    SET15_WAY0_DATA3;
    volatile    uint32_t    SET15_WAY1_DATA0;
    volatile    uint32_t    SET15_WAY1_DATA1;
    volatile    uint32_t    SET15_WAY1_DATA2;
    volatile    uint32_t    SET15_WAY1_DATA3;
    volatile    uint32_t    SET16_WAY0_DATA0;
    volatile    uint32_t    SET16_WAY0_DATA1;
    volatile    uint32_t    SET16_WAY0_DATA2;
    volatile    uint32_t    SET16_WAY0_DATA3;
    volatile    uint32_t    SET16_WAY1_DATA0;
    volatile    uint32_t    SET16_WAY1_DATA1;
    volatile    uint32_t    SET16_WAY1_DATA2;
    volatile    uint32_t    SET16_WAY1_DATA3;
    volatile    uint32_t    SET17_WAY0_DATA0;
    volatile    uint32_t    SET17_WAY0_DATA1;
    volatile    uint32_t    SET17_WAY0_DATA2;
    volatile    uint32_t    SET17_WAY0_DATA3;
    volatile    uint32_t    SET17_WAY1_DATA0;
    volatile    uint32_t    SET17_WAY1_DATA1;
    volatile    uint32_t    SET17_WAY1_DATA2;
    volatile    uint32_t    SET17_WAY1_DATA3;
    volatile    uint32_t    SET18_WAY0_DATA0;
    volatile    uint32_t    SET18_WAY0_DATA1;
    volatile    uint32_t    SET18_WAY0_DATA2;
    volatile    uint32_t    SET18_WAY0_DATA3;
    volatile    uint32_t    SET18_WAY1_DATA0;
    volatile    uint32_t    SET18_WAY1_DATA1;
    volatile    uint32_t    SET18_WAY1_DATA2;
    volatile    uint32_t    SET18_WAY1_DATA3;
    volatile    uint32_t    SET19_WAY0_DATA0;
    volatile    uint32_t    SET19_WAY0_DATA1;
    volatile    uint32_t    SET19_WAY0_DATA2;
    volatile    uint32_t    SET19_WAY0_DATA3;
    volatile    uint32_t    SET19_WAY1_DATA0;
    volatile    uint32_t    SET19_WAY1_DATA1;
    volatile    uint32_t    SET19_WAY1_DATA2;
    volatile    uint32_t    SET19_WAY1_DATA3;
    volatile    uint32_t    SET20_WAY0_DATA0;
    volatile    uint32_t    SET20_WAY0_DATA1;
    volatile    uint32_t    SET20_WAY0_DATA2;
    volatile    uint32_t    SET20_WAY0_DATA3;
    volatile    uint32_t    SET20_WAY1_DATA0;
    volatile    uint32_t    SET20_WAY1_DATA1;
    volatile    uint32_t    SET20_WAY1_DATA2;
    volatile    uint32_t    SET20_WAY1_DATA3;
    volatile    uint32_t    SET21_WAY0_DATA0;
    volatile    uint32_t    SET21_WAY0_DATA1;
    volatile    uint32_t    SET21_WAY0_DATA2;
    volatile    uint32_t    SET21_WAY0_DATA3;
    volatile    uint32_t    SET21_WAY1_DATA0;
    volatile    uint32_t    SET21_WAY1_DATA1;
    volatile    uint32_t    SET21_WAY1_DATA2;
    volatile    uint32_t    SET21_WAY1_DATA3;
    volatile    uint32_t    SET22_WAY0_DATA0;
    volatile    uint32_t    SET22_WAY0_DATA1;
    volatile    uint32_t    SET22_WAY0_DATA2;
    volatile    uint32_t    SET22_WAY0_DATA3;
    volatile    uint32_t    SET22_WAY1_DATA0;
    volatile    uint32_t    SET22_WAY1_DATA1;
    volatile    uint32_t    SET22_WAY1_DATA2;
    volatile    uint32_t    SET22_WAY1_DATA3;
    volatile    uint32_t    SET23_WAY0_DATA0;
    volatile    uint32_t    SET23_WAY0_DATA1;
    volatile    uint32_t    SET23_WAY0_DATA2;
    volatile    uint32_t    SET23_WAY0_DATA3;
    volatile    uint32_t    SET23_WAY1_DATA0;
    volatile    uint32_t    SET23_WAY1_DATA1;
    volatile    uint32_t    SET23_WAY1_DATA2;
    volatile    uint32_t    SET23_WAY1_DATA3;
    volatile    uint32_t    SET24_WAY0_DATA0;
    volatile    uint32_t    SET24_WAY0_DATA1;
    volatile    uint32_t    SET24_WAY0_DATA2;
    volatile    uint32_t    SET24_WAY0_DATA3;
    volatile    uint32_t    SET24_WAY1_DATA0;
    volatile    uint32_t    SET24_WAY1_DATA1;
    volatile    uint32_t    SET24_WAY1_DATA2;
    volatile    uint32_t    SET24_WAY1_DATA3;
    volatile    uint32_t    SET25_WAY0_DATA0;
    volatile    uint32_t    SET25_WAY0_DATA1;
    volatile    uint32_t    SET25_WAY0_DATA2;
    volatile    uint32_t    SET25_WAY0_DATA3;
    volatile    uint32_t    SET25_WAY1_DATA0;
    volatile    uint32_t    SET25_WAY1_DATA1;
    volatile    uint32_t    SET25_WAY1_DATA2;
    volatile    uint32_t    SET25_WAY1_DATA3;
    volatile    uint32_t    SET26_WAY0_DATA0;
    volatile    uint32_t    SET26_WAY0_DATA1;
    volatile    uint32_t    SET26_WAY0_DATA2;
    volatile    uint32_t    SET26_WAY0_DATA3;
    volatile    uint32_t    SET26_WAY1_DATA0;
    volatile    uint32_t    SET26_WAY1_DATA1;
    volatile    uint32_t    SET26_WAY1_DATA2;
    volatile    uint32_t    SET26_WAY1_DATA3;
    volatile    uint32_t    SET27_WAY0_DATA0;
    volatile    uint32_t    SET27_WAY0_DATA1;
    volatile    uint32_t    SET27_WAY0_DATA2;
    volatile    uint32_t    SET27_WAY0_DATA3;
    volatile    uint32_t    SET27_WAY1_DATA0;
    volatile    uint32_t    SET27_WAY1_DATA1;
    volatile    uint32_t    SET27_WAY1_DATA2;
    volatile    uint32_t    SET27_WAY1_DATA3;
    volatile    uint32_t    SET28_WAY0_DATA0;
    volatile    uint32_t    SET28_WAY0_DATA1;
    volatile    uint32_t    SET28_WAY0_DATA2;
    volatile    uint32_t    SET28_WAY0_DATA3;
    volatile    uint32_t    SET28_WAY1_DATA0;
    volatile    uint32_t    SET28_WAY1_DATA1;
    volatile    uint32_t    SET28_WAY1_DATA2;
    volatile    uint32_t    SET28_WAY1_DATA3;
    volatile    uint32_t    SET29_WAY0_DATA0;
    volatile    uint32_t    SET29_WAY0_DATA1;
    volatile    uint32_t    SET29_WAY0_DATA2;
    volatile    uint32_t    SET29_WAY0_DATA3;
    volatile    uint32_t    SET29_WAY1_DATA0;
    volatile    uint32_t    SET29_WAY1_DATA1;
    volatile    uint32_t    SET29_WAY1_DATA2;
    volatile    uint32_t    SET29_WAY1_DATA3;
    volatile    uint32_t    SET30_WAY0_DATA0;
    volatile    uint32_t    SET30_WAY0_DATA1;
    volatile    uint32_t    SET30_WAY0_DATA2;
    volatile    uint32_t    SET30_WAY0_DATA3;
    volatile    uint32_t    SET30_WAY1_DATA0;
    volatile    uint32_t    SET30_WAY1_DATA1;
    volatile    uint32_t    SET30_WAY1_DATA2;
    volatile    uint32_t    SET30_WAY1_DATA3;
    volatile    uint32_t    SET31_WAY0_DATA0;
    volatile    uint32_t    SET31_WAY0_DATA1;
    volatile    uint32_t    SET31_WAY0_DATA2;
    volatile    uint32_t    SET31_WAY0_DATA3;
    volatile    uint32_t    SET31_WAY1_DATA0;
    volatile    uint32_t    SET31_WAY1_DATA1;
    volatile    uint32_t    SET31_WAY1_DATA2;
    volatile    uint32_t    SET31_WAY1_DATA3;
    volatile    uint32_t    SET32_WAY0_DATA0;
    volatile    uint32_t    SET32_WAY0_DATA1;
    volatile    uint32_t    SET32_WAY0_DATA2;
    volatile    uint32_t    SET32_WAY0_DATA3;
    volatile    uint32_t    SET32_WAY1_DATA0;
    volatile    uint32_t    SET32_WAY1_DATA1;
    volatile    uint32_t    SET32_WAY1_DATA2;
    volatile    uint32_t    SET32_WAY1_DATA3;
    volatile    uint32_t    SET33_WAY0_DATA0;
    volatile    uint32_t    SET33_WAY0_DATA1;
    volatile    uint32_t    SET33_WAY0_DATA2;
    volatile    uint32_t    SET33_WAY0_DATA3;
    volatile    uint32_t    SET33_WAY1_DATA0;
    volatile    uint32_t    SET33_WAY1_DATA1;
    volatile    uint32_t    SET33_WAY1_DATA2;
    volatile    uint32_t    SET33_WAY1_DATA3;
    volatile    uint32_t    SET34_WAY0_DATA0;
    volatile    uint32_t    SET34_WAY0_DATA1;
    volatile    uint32_t    SET34_WAY0_DATA2;
    volatile    uint32_t    SET34_WAY0_DATA3;
    volatile    uint32_t    SET34_WAY1_DATA0;
    volatile    uint32_t    SET34_WAY1_DATA1;
    volatile    uint32_t    SET34_WAY1_DATA2;
    volatile    uint32_t    SET34_WAY1_DATA3;
    volatile    uint32_t    SET35_WAY0_DATA0;
    volatile    uint32_t    SET35_WAY0_DATA1;
    volatile    uint32_t    SET35_WAY0_DATA2;
    volatile    uint32_t    SET35_WAY0_DATA3;
    volatile    uint32_t    SET35_WAY1_DATA0;
    volatile    uint32_t    SET35_WAY1_DATA1;
    volatile    uint32_t    SET35_WAY1_DATA2;
    volatile    uint32_t    SET35_WAY1_DATA3;
    volatile    uint32_t    SET36_WAY0_DATA0;
    volatile    uint32_t    SET36_WAY0_DATA1;
    volatile    uint32_t    SET36_WAY0_DATA2;
    volatile    uint32_t    SET36_WAY0_DATA3;
    volatile    uint32_t    SET36_WAY1_DATA0;
    volatile    uint32_t    SET36_WAY1_DATA1;
    volatile    uint32_t    SET36_WAY1_DATA2;
    volatile    uint32_t    SET36_WAY1_DATA3;
    volatile    uint32_t    SET37_WAY0_DATA0;
    volatile    uint32_t    SET37_WAY0_DATA1;
    volatile    uint32_t    SET37_WAY0_DATA2;
    volatile    uint32_t    SET37_WAY0_DATA3;
    volatile    uint32_t    SET37_WAY1_DATA0;
    volatile    uint32_t    SET37_WAY1_DATA1;
    volatile    uint32_t    SET37_WAY1_DATA2;
    volatile    uint32_t    SET37_WAY1_DATA3;
    volatile    uint32_t    SET38_WAY0_DATA0;
    volatile    uint32_t    SET38_WAY0_DATA1;
    volatile    uint32_t    SET38_WAY0_DATA2;
    volatile    uint32_t    SET38_WAY0_DATA3;
    volatile    uint32_t    SET38_WAY1_DATA0;
    volatile    uint32_t    SET38_WAY1_DATA1;
    volatile    uint32_t    SET38_WAY1_DATA2;
    volatile    uint32_t    SET38_WAY1_DATA3;
    volatile    uint32_t    SET39_WAY0_DATA0;
    volatile    uint32_t    SET39_WAY0_DATA1;
    volatile    uint32_t    SET39_WAY0_DATA2;
    volatile    uint32_t    SET39_WAY0_DATA3;
    volatile    uint32_t    SET39_WAY1_DATA0;
    volatile    uint32_t    SET39_WAY1_DATA1;
    volatile    uint32_t    SET39_WAY1_DATA2;
    volatile    uint32_t    SET39_WAY1_DATA3;
    volatile    uint32_t    SET40_WAY0_DATA0;
    volatile    uint32_t    SET40_WAY0_DATA1;
    volatile    uint32_t    SET40_WAY0_DATA2;
    volatile    uint32_t    SET40_WAY0_DATA3;
    volatile    uint32_t    SET40_WAY1_DATA0;
    volatile    uint32_t    SET40_WAY1_DATA1;
    volatile    uint32_t    SET40_WAY1_DATA2;
    volatile    uint32_t    SET40_WAY1_DATA3;
    volatile    uint32_t    SET41_WAY0_DATA0;
    volatile    uint32_t    SET41_WAY0_DATA1;
    volatile    uint32_t    SET41_WAY0_DATA2;
    volatile    uint32_t    SET41_WAY0_DATA3;
    volatile    uint32_t    SET41_WAY1_DATA0;
    volatile    uint32_t    SET41_WAY1_DATA1;
    volatile    uint32_t    SET41_WAY1_DATA2;
    volatile    uint32_t    SET41_WAY1_DATA3;
    volatile    uint32_t    SET42_WAY0_DATA0;
    volatile    uint32_t    SET42_WAY0_DATA1;
    volatile    uint32_t    SET42_WAY0_DATA2;
    volatile    uint32_t    SET42_WAY0_DATA3;
    volatile    uint32_t    SET42_WAY1_DATA0;
    volatile    uint32_t    SET42_WAY1_DATA1;
    volatile    uint32_t    SET42_WAY1_DATA2;
    volatile    uint32_t    SET42_WAY1_DATA3;
    volatile    uint32_t    SET43_WAY0_DATA0;
    volatile    uint32_t    SET43_WAY0_DATA1;
    volatile    uint32_t    SET43_WAY0_DATA2;
    volatile    uint32_t    SET43_WAY0_DATA3;
    volatile    uint32_t    SET43_WAY1_DATA0;
    volatile    uint32_t    SET43_WAY1_DATA1;
    volatile    uint32_t    SET43_WAY1_DATA2;
    volatile    uint32_t    SET43_WAY1_DATA3;
    volatile    uint32_t    SET44_WAY0_DATA0;
    volatile    uint32_t    SET44_WAY0_DATA1;
    volatile    uint32_t    SET44_WAY0_DATA2;
    volatile    uint32_t    SET44_WAY0_DATA3;
    volatile    uint32_t    SET44_WAY1_DATA0;
    volatile    uint32_t    SET44_WAY1_DATA1;
    volatile    uint32_t    SET44_WAY1_DATA2;
    volatile    uint32_t    SET44_WAY1_DATA3;
    volatile    uint32_t    SET45_WAY0_DATA0;
    volatile    uint32_t    SET45_WAY0_DATA1;
    volatile    uint32_t    SET45_WAY0_DATA2;
    volatile    uint32_t    SET45_WAY0_DATA3;
    volatile    uint32_t    SET45_WAY1_DATA0;
    volatile    uint32_t    SET45_WAY1_DATA1;
    volatile    uint32_t    SET45_WAY1_DATA2;
    volatile    uint32_t    SET45_WAY1_DATA3;
    volatile    uint32_t    SET46_WAY0_DATA0;
    volatile    uint32_t    SET46_WAY0_DATA1;
    volatile    uint32_t    SET46_WAY0_DATA2;
    volatile    uint32_t    SET46_WAY0_DATA3;
    volatile    uint32_t    SET46_WAY1_DATA0;
    volatile    uint32_t    SET46_WAY1_DATA1;
    volatile    uint32_t    SET46_WAY1_DATA2;
    volatile    uint32_t    SET46_WAY1_DATA3;
    volatile    uint32_t    SET47_WAY0_DATA0;
    volatile    uint32_t    SET47_WAY0_DATA1;
    volatile    uint32_t    SET47_WAY0_DATA2;
    volatile    uint32_t    SET47_WAY0_DATA3;
    volatile    uint32_t    SET47_WAY1_DATA0;
    volatile    uint32_t    SET47_WAY1_DATA1;
    volatile    uint32_t    SET47_WAY1_DATA2;
    volatile    uint32_t    SET47_WAY1_DATA3;
    volatile    uint32_t    SET48_WAY0_DATA0;
    volatile    uint32_t    SET48_WAY0_DATA1;
    volatile    uint32_t    SET48_WAY0_DATA2;
    volatile    uint32_t    SET48_WAY0_DATA3;
    volatile    uint32_t    SET48_WAY1_DATA0;
    volatile    uint32_t    SET48_WAY1_DATA1;
    volatile    uint32_t    SET48_WAY1_DATA2;
    volatile    uint32_t    SET48_WAY1_DATA3;
    volatile    uint32_t    SET49_WAY0_DATA0;
    volatile    uint32_t    SET49_WAY0_DATA1;
    volatile    uint32_t    SET49_WAY0_DATA2;
    volatile    uint32_t    SET49_WAY0_DATA3;
    volatile    uint32_t    SET49_WAY1_DATA0;
    volatile    uint32_t    SET49_WAY1_DATA1;
    volatile    uint32_t    SET49_WAY1_DATA2;
    volatile    uint32_t    SET49_WAY1_DATA3;
    volatile    uint32_t    SET50_WAY0_DATA0;
    volatile    uint32_t    SET50_WAY0_DATA1;
    volatile    uint32_t    SET50_WAY0_DATA2;
    volatile    uint32_t    SET50_WAY0_DATA3;
    volatile    uint32_t    SET50_WAY1_DATA0;
    volatile    uint32_t    SET50_WAY1_DATA1;
    volatile    uint32_t    SET50_WAY1_DATA2;
    volatile    uint32_t    SET50_WAY1_DATA3;
    volatile    uint32_t    SET51_WAY0_DATA0;
    volatile    uint32_t    SET51_WAY0_DATA1;
    volatile    uint32_t    SET51_WAY0_DATA2;
    volatile    uint32_t    SET51_WAY0_DATA3;
    volatile    uint32_t    SET51_WAY1_DATA0;
    volatile    uint32_t    SET51_WAY1_DATA1;
    volatile    uint32_t    SET51_WAY1_DATA2;
    volatile    uint32_t    SET51_WAY1_DATA3;
    volatile    uint32_t    SET52_WAY0_DATA0;
    volatile    uint32_t    SET52_WAY0_DATA1;
    volatile    uint32_t    SET52_WAY0_DATA2;
    volatile    uint32_t    SET52_WAY0_DATA3;
    volatile    uint32_t    SET52_WAY1_DATA0;
    volatile    uint32_t    SET52_WAY1_DATA1;
    volatile    uint32_t    SET52_WAY1_DATA2;
    volatile    uint32_t    SET52_WAY1_DATA3;
    volatile    uint32_t    SET53_WAY0_DATA0;
    volatile    uint32_t    SET53_WAY0_DATA1;
    volatile    uint32_t    SET53_WAY0_DATA2;
    volatile    uint32_t    SET53_WAY0_DATA3;
    volatile    uint32_t    SET53_WAY1_DATA0;
    volatile    uint32_t    SET53_WAY1_DATA1;
    volatile    uint32_t    SET53_WAY1_DATA2;
    volatile    uint32_t    SET53_WAY1_DATA3;
    volatile    uint32_t    SET54_WAY0_DATA0;
    volatile    uint32_t    SET54_WAY0_DATA1;
    volatile    uint32_t    SET54_WAY0_DATA2;
    volatile    uint32_t    SET54_WAY0_DATA3;
    volatile    uint32_t    SET54_WAY1_DATA0;
    volatile    uint32_t    SET54_WAY1_DATA1;
    volatile    uint32_t    SET54_WAY1_DATA2;
    volatile    uint32_t    SET54_WAY1_DATA3;
    volatile    uint32_t    SET55_WAY0_DATA0;
    volatile    uint32_t    SET55_WAY0_DATA1;
    volatile    uint32_t    SET55_WAY0_DATA2;
    volatile    uint32_t    SET55_WAY0_DATA3;
    volatile    uint32_t    SET55_WAY1_DATA0;
    volatile    uint32_t    SET55_WAY1_DATA1;
    volatile    uint32_t    SET55_WAY1_DATA2;
    volatile    uint32_t    SET55_WAY1_DATA3;
    volatile    uint32_t    SET56_WAY0_DATA0;
    volatile    uint32_t    SET56_WAY0_DATA1;
    volatile    uint32_t    SET56_WAY0_DATA2;
    volatile    uint32_t    SET56_WAY0_DATA3;
    volatile    uint32_t    SET56_WAY1_DATA0;
    volatile    uint32_t    SET56_WAY1_DATA1;
    volatile    uint32_t    SET56_WAY1_DATA2;
    volatile    uint32_t    SET56_WAY1_DATA3;
    volatile    uint32_t    SET57_WAY0_DATA0;
    volatile    uint32_t    SET57_WAY0_DATA1;
    volatile    uint32_t    SET57_WAY0_DATA2;
    volatile    uint32_t    SET57_WAY0_DATA3;
    volatile    uint32_t    SET57_WAY1_DATA0;
    volatile    uint32_t    SET57_WAY1_DATA1;
    volatile    uint32_t    SET57_WAY1_DATA2;
    volatile    uint32_t    SET57_WAY1_DATA3;
    volatile    uint32_t    SET58_WAY0_DATA0;
    volatile    uint32_t    SET58_WAY0_DATA1;
    volatile    uint32_t    SET58_WAY0_DATA2;
    volatile    uint32_t    SET58_WAY0_DATA3;
    volatile    uint32_t    SET58_WAY1_DATA0;
    volatile    uint32_t    SET58_WAY1_DATA1;
    volatile    uint32_t    SET58_WAY1_DATA2;
    volatile    uint32_t    SET58_WAY1_DATA3;
    volatile    uint32_t    SET59_WAY0_DATA0;
    volatile    uint32_t    SET59_WAY0_DATA1;
    volatile    uint32_t    SET59_WAY0_DATA2;
    volatile    uint32_t    SET59_WAY0_DATA3;
    volatile    uint32_t    SET59_WAY1_DATA0;
    volatile    uint32_t    SET59_WAY1_DATA1;
    volatile    uint32_t    SET59_WAY1_DATA2;
    volatile    uint32_t    SET59_WAY1_DATA3;
    volatile    uint32_t    SET60_WAY0_DATA0;
    volatile    uint32_t    SET60_WAY0_DATA1;
    volatile    uint32_t    SET60_WAY0_DATA2;
    volatile    uint32_t    SET60_WAY0_DATA3;
    volatile    uint32_t    SET60_WAY1_DATA0;
    volatile    uint32_t    SET60_WAY1_DATA1;
    volatile    uint32_t    SET60_WAY1_DATA2;
    volatile    uint32_t    SET60_WAY1_DATA3;
    volatile    uint32_t    SET61_WAY0_DATA0;
    volatile    uint32_t    SET61_WAY0_DATA1;
    volatile    uint32_t    SET61_WAY0_DATA2;
    volatile    uint32_t    SET61_WAY0_DATA3;
    volatile    uint32_t    SET61_WAY1_DATA0;
    volatile    uint32_t    SET61_WAY1_DATA1;
    volatile    uint32_t    SET61_WAY1_DATA2;
    volatile    uint32_t    SET61_WAY1_DATA3;
    volatile    uint32_t    SET62_WAY0_DATA0;
    volatile    uint32_t    SET62_WAY0_DATA1;
    volatile    uint32_t    SET62_WAY0_DATA2;
    volatile    uint32_t    SET62_WAY0_DATA3;
    volatile    uint32_t    SET62_WAY1_DATA0;
    volatile    uint32_t    SET62_WAY1_DATA1;
    volatile    uint32_t    SET62_WAY1_DATA2;
    volatile    uint32_t    SET62_WAY1_DATA3;
    volatile    uint32_t    SET63_WAY0_DATA0;
    volatile    uint32_t    SET63_WAY0_DATA1;
    volatile    uint32_t    SET63_WAY0_DATA2;
    volatile    uint32_t    SET63_WAY0_DATA3;
    volatile    uint32_t    SET63_WAY1_DATA0;
