Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_cachedata.h
    volatile    uint32_t    SET63_WAY1_DATA1;
    volatile    uint32_t    SET63_WAY1_DATA2;
    volatile    uint32_t    SET63_WAY1_DATA3;
    volatile    uint32_t    SET64_WAY0_DATA0;
    volatile    uint32_t    SET64_WAY0_DATA1;
    volatile    uint32_t    SET64_WAY0_DATA2;
    volatile    uint32_t    SET64_WAY0_DATA3;
    volatile    uint32_t    SET64_WAY1_DATA0;
    volatile    uint32_t    SET64_WAY1_DATA1;
    volatile    uint32_t    SET64_WAY1_DATA2;
    volatile    uint32_t    SET64_WAY1_DATA3;
    volatile    uint32_t    SET65_WAY0_DATA0;
    volatile    uint32_t    SET65_WAY0_DATA1;
    volatile    uint32_t    SET65_WAY0_DATA2;
    volatile    uint32_t    SET65_WAY0_DATA3;
    volatile    uint32_t    SET65_WAY1_DATA0;
    volatile    uint32_t    SET65_WAY1_DATA1;
    volatile    uint32_t    SET65_WAY1_DATA2;
    volatile    uint32_t    SET65_WAY1_DATA3;
    volatile    uint32_t    SET66_WAY0_DATA0;
    volatile    uint32_t    SET66_WAY0_DATA1;
    volatile    uint32_t    SET66_WAY0_DATA2;
    volatile    uint32_t    SET66_WAY0_DATA3;
    volatile    uint32_t    SET66_WAY1_DATA0;
    volatile    uint32_t    SET66_WAY1_DATA1;
    volatile    uint32_t    SET66_WAY1_DATA2;
    volatile    uint32_t    SET66_WAY1_DATA3;
    volatile    uint32_t    SET67_WAY0_DATA0;
    volatile    uint32_t    SET67_WAY0_DATA1;
    volatile    uint32_t    SET67_WAY0_DATA2;
    volatile    uint32_t    SET67_WAY0_DATA3;
    volatile    uint32_t    SET67_WAY1_DATA0;
    volatile    uint32_t    SET67_WAY1_DATA1;
    volatile    uint32_t    SET67_WAY1_DATA2;
    volatile    uint32_t    SET67_WAY1_DATA3;
    volatile    uint32_t    SET68_WAY0_DATA0;
    volatile    uint32_t    SET68_WAY0_DATA1;
    volatile    uint32_t    SET68_WAY0_DATA2;
    volatile    uint32_t    SET68_WAY0_DATA3;
    volatile    uint32_t    SET68_WAY1_DATA0;
    volatile    uint32_t    SET68_WAY1_DATA1;
    volatile    uint32_t    SET68_WAY1_DATA2;
    volatile    uint32_t    SET68_WAY1_DATA3;
    volatile    uint32_t    SET69_WAY0_DATA0;
    volatile    uint32_t    SET69_WAY0_DATA1;
    volatile    uint32_t    SET69_WAY0_DATA2;
    volatile    uint32_t    SET69_WAY0_DATA3;
    volatile    uint32_t    SET69_WAY1_DATA0;
    volatile    uint32_t    SET69_WAY1_DATA1;
    volatile    uint32_t    SET69_WAY1_DATA2;
    volatile    uint32_t    SET69_WAY1_DATA3;
    volatile    uint32_t    SET70_WAY0_DATA0;
    volatile    uint32_t    SET70_WAY0_DATA1;
    volatile    uint32_t    SET70_WAY0_DATA2;
    volatile    uint32_t    SET70_WAY0_DATA3;
    volatile    uint32_t    SET70_WAY1_DATA0;
    volatile    uint32_t    SET70_WAY1_DATA1;
    volatile    uint32_t    SET70_WAY1_DATA2;
    volatile    uint32_t    SET70_WAY1_DATA3;
    volatile    uint32_t    SET71_WAY0_DATA0;
    volatile    uint32_t    SET71_WAY0_DATA1;
    volatile    uint32_t    SET71_WAY0_DATA2;
    volatile    uint32_t    SET71_WAY0_DATA3;
    volatile    uint32_t    SET71_WAY1_DATA0;
    volatile    uint32_t    SET71_WAY1_DATA1;
    volatile    uint32_t    SET71_WAY1_DATA2;
    volatile    uint32_t    SET71_WAY1_DATA3;
    volatile    uint32_t    SET72_WAY0_DATA0;
    volatile    uint32_t    SET72_WAY0_DATA1;
    volatile    uint32_t    SET72_WAY0_DATA2;
    volatile    uint32_t    SET72_WAY0_DATA3;
    volatile    uint32_t    SET72_WAY1_DATA0;
    volatile    uint32_t    SET72_WAY1_DATA1;
    volatile    uint32_t    SET72_WAY1_DATA2;
    volatile    uint32_t    SET72_WAY1_DATA3;
    volatile    uint32_t    SET73_WAY0_DATA0;
    volatile    uint32_t    SET73_WAY0_DATA1;
    volatile    uint32_t    SET73_WAY0_DATA2;
    volatile    uint32_t    SET73_WAY0_DATA3;
    volatile    uint32_t    SET73_WAY1_DATA0;
    volatile    uint32_t    SET73_WAY1_DATA1;
    volatile    uint32_t    SET73_WAY1_DATA2;
    volatile    uint32_t    SET73_WAY1_DATA3;
    volatile    uint32_t    SET74_WAY0_DATA0;
    volatile    uint32_t    SET74_WAY0_DATA1;
    volatile    uint32_t    SET74_WAY0_DATA2;
    volatile    uint32_t    SET74_WAY0_DATA3;
    volatile    uint32_t    SET74_WAY1_DATA0;
    volatile    uint32_t    SET74_WAY1_DATA1;
    volatile    uint32_t    SET74_WAY1_DATA2;
    volatile    uint32_t    SET74_WAY1_DATA3;
    volatile    uint32_t    SET75_WAY0_DATA0;
    volatile    uint32_t    SET75_WAY0_DATA1;
    volatile    uint32_t    SET75_WAY0_DATA2;
    volatile    uint32_t    SET75_WAY0_DATA3;
    volatile    uint32_t    SET75_WAY1_DATA0;
    volatile    uint32_t    SET75_WAY1_DATA1;
    volatile    uint32_t    SET75_WAY1_DATA2;
    volatile    uint32_t    SET75_WAY1_DATA3;
    volatile    uint32_t    SET76_WAY0_DATA0;
    volatile    uint32_t    SET76_WAY0_DATA1;
    volatile    uint32_t    SET76_WAY0_DATA2;
    volatile    uint32_t    SET76_WAY0_DATA3;
    volatile    uint32_t    SET76_WAY1_DATA0;
    volatile    uint32_t    SET76_WAY1_DATA1;
    volatile    uint32_t    SET76_WAY1_DATA2;
    volatile    uint32_t    SET76_WAY1_DATA3;
    volatile    uint32_t    SET77_WAY0_DATA0;
    volatile    uint32_t    SET77_WAY0_DATA1;
    volatile    uint32_t    SET77_WAY0_DATA2;
    volatile    uint32_t    SET77_WAY0_DATA3;
    volatile    uint32_t    SET77_WAY1_DATA0;
    volatile    uint32_t    SET77_WAY1_DATA1;
    volatile    uint32_t    SET77_WAY1_DATA2;
    volatile    uint32_t    SET77_WAY1_DATA3;
    volatile    uint32_t    SET78_WAY0_DATA0;
    volatile    uint32_t    SET78_WAY0_DATA1;
    volatile    uint32_t    SET78_WAY0_DATA2;
    volatile    uint32_t    SET78_WAY0_DATA3;
    volatile    uint32_t    SET78_WAY1_DATA0;
    volatile    uint32_t    SET78_WAY1_DATA1;
    volatile    uint32_t    SET78_WAY1_DATA2;
    volatile    uint32_t    SET78_WAY1_DATA3;
    volatile    uint32_t    SET79_WAY0_DATA0;
    volatile    uint32_t    SET79_WAY0_DATA1;
    volatile    uint32_t    SET79_WAY0_DATA2;
    volatile    uint32_t    SET79_WAY0_DATA3;
    volatile    uint32_t    SET79_WAY1_DATA0;
    volatile    uint32_t    SET79_WAY1_DATA1;
    volatile    uint32_t    SET79_WAY1_DATA2;
    volatile    uint32_t    SET79_WAY1_DATA3;
    volatile    uint32_t    SET80_WAY0_DATA0;
    volatile    uint32_t    SET80_WAY0_DATA1;
    volatile    uint32_t    SET80_WAY0_DATA2;
    volatile    uint32_t    SET80_WAY0_DATA3;
    volatile    uint32_t    SET80_WAY1_DATA0;
    volatile    uint32_t    SET80_WAY1_DATA1;
    volatile    uint32_t    SET80_WAY1_DATA2;
    volatile    uint32_t    SET80_WAY1_DATA3;
    volatile    uint32_t    SET81_WAY0_DATA0;
    volatile    uint32_t    SET81_WAY0_DATA1;
    volatile    uint32_t    SET81_WAY0_DATA2;
    volatile    uint32_t    SET81_WAY0_DATA3;
    volatile    uint32_t    SET81_WAY1_DATA0;
    volatile    uint32_t    SET81_WAY1_DATA1;
    volatile    uint32_t    SET81_WAY1_DATA2;
    volatile    uint32_t    SET81_WAY1_DATA3;
    volatile    uint32_t    SET82_WAY0_DATA0;
    volatile    uint32_t    SET82_WAY0_DATA1;
    volatile    uint32_t    SET82_WAY0_DATA2;
    volatile    uint32_t    SET82_WAY0_DATA3;
    volatile    uint32_t    SET82_WAY1_DATA0;
    volatile    uint32_t    SET82_WAY1_DATA1;
    volatile    uint32_t    SET82_WAY1_DATA2;
    volatile    uint32_t    SET82_WAY1_DATA3;
    volatile    uint32_t    SET83_WAY0_DATA0;
    volatile    uint32_t    SET83_WAY0_DATA1;
    volatile    uint32_t    SET83_WAY0_DATA2;
    volatile    uint32_t    SET83_WAY0_DATA3;
    volatile    uint32_t    SET83_WAY1_DATA0;
    volatile    uint32_t    SET83_WAY1_DATA1;
    volatile    uint32_t    SET83_WAY1_DATA2;
    volatile    uint32_t    SET83_WAY1_DATA3;
    volatile    uint32_t    SET84_WAY0_DATA0;
    volatile    uint32_t    SET84_WAY0_DATA1;
    volatile    uint32_t    SET84_WAY0_DATA2;
    volatile    uint32_t    SET84_WAY0_DATA3;
    volatile    uint32_t    SET84_WAY1_DATA0;
    volatile    uint32_t    SET84_WAY1_DATA1;
    volatile    uint32_t    SET84_WAY1_DATA2;
    volatile    uint32_t    SET84_WAY1_DATA3;
    volatile    uint32_t    SET85_WAY0_DATA0;
    volatile    uint32_t    SET85_WAY0_DATA1;
    volatile    uint32_t    SET85_WAY0_DATA2;
    volatile    uint32_t    SET85_WAY0_DATA3;
    volatile    uint32_t    SET85_WAY1_DATA0;
    volatile    uint32_t    SET85_WAY1_DATA1;
    volatile    uint32_t    SET85_WAY1_DATA2;
    volatile    uint32_t    SET85_WAY1_DATA3;
    volatile    uint32_t    SET86_WAY0_DATA0;
    volatile    uint32_t    SET86_WAY0_DATA1;
    volatile    uint32_t    SET86_WAY0_DATA2;
    volatile    uint32_t    SET86_WAY0_DATA3;
    volatile    uint32_t    SET86_WAY1_DATA0;
    volatile    uint32_t    SET86_WAY1_DATA1;
    volatile    uint32_t    SET86_WAY1_DATA2;
    volatile    uint32_t    SET86_WAY1_DATA3;
    volatile    uint32_t    SET87_WAY0_DATA0;
    volatile    uint32_t    SET87_WAY0_DATA1;
    volatile    uint32_t    SET87_WAY0_DATA2;
    volatile    uint32_t    SET87_WAY0_DATA3;
    volatile    uint32_t    SET87_WAY1_DATA0;
    volatile    uint32_t    SET87_WAY1_DATA1;
    volatile    uint32_t    SET87_WAY1_DATA2;
    volatile    uint32_t    SET87_WAY1_DATA3;
    volatile    uint32_t    SET88_WAY0_DATA0;
    volatile    uint32_t    SET88_WAY0_DATA1;
    volatile    uint32_t    SET88_WAY0_DATA2;
    volatile    uint32_t    SET88_WAY0_DATA3;
    volatile    uint32_t    SET88_WAY1_DATA0;
    volatile    uint32_t    SET88_WAY1_DATA1;
    volatile    uint32_t    SET88_WAY1_DATA2;
    volatile    uint32_t    SET88_WAY1_DATA3;
    volatile    uint32_t    SET89_WAY0_DATA0;
    volatile    uint32_t    SET89_WAY0_DATA1;
    volatile    uint32_t    SET89_WAY0_DATA2;
    volatile    uint32_t    SET89_WAY0_DATA3;
    volatile    uint32_t    SET89_WAY1_DATA0;
    volatile    uint32_t    SET89_WAY1_DATA1;
    volatile    uint32_t    SET89_WAY1_DATA2;
    volatile    uint32_t    SET89_WAY1_DATA3;
    volatile    uint32_t    SET90_WAY0_DATA0;
    volatile    uint32_t    SET90_WAY0_DATA1;
    volatile    uint32_t    SET90_WAY0_DATA2;
    volatile    uint32_t    SET90_WAY0_DATA3;
    volatile    uint32_t    SET90_WAY1_DATA0;
    volatile    uint32_t    SET90_WAY1_DATA1;
    volatile    uint32_t    SET90_WAY1_DATA2;
    volatile    uint32_t    SET90_WAY1_DATA3;
    volatile    uint32_t    SET91_WAY0_DATA0;
    volatile    uint32_t    SET91_WAY0_DATA1;
    volatile    uint32_t    SET91_WAY0_DATA2;
    volatile    uint32_t    SET91_WAY0_DATA3;
    volatile    uint32_t    SET91_WAY1_DATA0;
    volatile    uint32_t    SET91_WAY1_DATA1;
    volatile    uint32_t    SET91_WAY1_DATA2;
    volatile    uint32_t    SET91_WAY1_DATA3;
    volatile    uint32_t    SET92_WAY0_DATA0;
    volatile    uint32_t    SET92_WAY0_DATA1;
    volatile    uint32_t    SET92_WAY0_DATA2;
    volatile    uint32_t    SET92_WAY0_DATA3;
    volatile    uint32_t    SET92_WAY1_DATA0;
    volatile    uint32_t    SET92_WAY1_DATA1;
    volatile    uint32_t    SET92_WAY1_DATA2;
    volatile    uint32_t    SET92_WAY1_DATA3;
    volatile    uint32_t    SET93_WAY0_DATA0;
    volatile    uint32_t    SET93_WAY0_DATA1;
    volatile    uint32_t    SET93_WAY0_DATA2;
    volatile    uint32_t    SET93_WAY0_DATA3;
    volatile    uint32_t    SET93_WAY1_DATA0;
    volatile    uint32_t    SET93_WAY1_DATA1;
    volatile    uint32_t    SET93_WAY1_DATA2;
    volatile    uint32_t    SET93_WAY1_DATA3;
    volatile    uint32_t    SET94_WAY0_DATA0;
    volatile    uint32_t    SET94_WAY0_DATA1;
    volatile    uint32_t    SET94_WAY0_DATA2;
    volatile    uint32_t    SET94_WAY0_DATA3;
    volatile    uint32_t    SET94_WAY1_DATA0;
    volatile    uint32_t    SET94_WAY1_DATA1;
    volatile    uint32_t    SET94_WAY1_DATA2;
    volatile    uint32_t    SET94_WAY1_DATA3;
    volatile    uint32_t    SET95_WAY0_DATA0;
    volatile    uint32_t    SET95_WAY0_DATA1;
    volatile    uint32_t    SET95_WAY0_DATA2;
    volatile    uint32_t    SET95_WAY0_DATA3;
    volatile    uint32_t    SET95_WAY1_DATA0;
    volatile    uint32_t    SET95_WAY1_DATA1;
    volatile    uint32_t    SET95_WAY1_DATA2;
    volatile    uint32_t    SET95_WAY1_DATA3;
    volatile    uint32_t    SET96_WAY0_DATA0;
    volatile    uint32_t    SET96_WAY0_DATA1;
    volatile    uint32_t    SET96_WAY0_DATA2;
    volatile    uint32_t    SET96_WAY0_DATA3;
    volatile    uint32_t    SET96_WAY1_DATA0;
    volatile    uint32_t    SET96_WAY1_DATA1;
    volatile    uint32_t    SET96_WAY1_DATA2;
    volatile    uint32_t    SET96_WAY1_DATA3;
    volatile    uint32_t    SET97_WAY0_DATA0;
    volatile    uint32_t    SET97_WAY0_DATA1;
    volatile    uint32_t    SET97_WAY0_DATA2;
    volatile    uint32_t    SET97_WAY0_DATA3;
    volatile    uint32_t    SET97_WAY1_DATA0;
    volatile    uint32_t    SET97_WAY1_DATA1;
    volatile    uint32_t    SET97_WAY1_DATA2;
    volatile    uint32_t    SET97_WAY1_DATA3;
    volatile    uint32_t    SET98_WAY0_DATA0;
    volatile    uint32_t    SET98_WAY0_DATA1;
    volatile    uint32_t    SET98_WAY0_DATA2;
    volatile    uint32_t    SET98_WAY0_DATA3;
    volatile    uint32_t    SET98_WAY1_DATA0;
    volatile    uint32_t    SET98_WAY1_DATA1;
    volatile    uint32_t    SET98_WAY1_DATA2;
    volatile    uint32_t    SET98_WAY1_DATA3;
    volatile    uint32_t    SET99_WAY0_DATA0;
    volatile    uint32_t    SET99_WAY0_DATA1;
    volatile    uint32_t    SET99_WAY0_DATA2;
    volatile    uint32_t    SET99_WAY0_DATA3;
    volatile    uint32_t    SET99_WAY1_DATA0;
    volatile    uint32_t    SET99_WAY1_DATA1;
    volatile    uint32_t    SET99_WAY1_DATA2;
    volatile    uint32_t    SET99_WAY1_DATA3;
    volatile    uint32_t    SET100_WAY0_DATA0;
    volatile    uint32_t    SET100_WAY0_DATA1;
    volatile    uint32_t    SET100_WAY0_DATA2;
    volatile    uint32_t    SET100_WAY0_DATA3;
    volatile    uint32_t    SET100_WAY1_DATA0;
    volatile    uint32_t    SET100_WAY1_DATA1;
    volatile    uint32_t    SET100_WAY1_DATA2;
    volatile    uint32_t    SET100_WAY1_DATA3;
    volatile    uint32_t    SET101_WAY0_DATA0;
    volatile    uint32_t    SET101_WAY0_DATA1;
    volatile    uint32_t    SET101_WAY0_DATA2;
    volatile    uint32_t    SET101_WAY0_DATA3;
    volatile    uint32_t    SET101_WAY1_DATA0;
    volatile    uint32_t    SET101_WAY1_DATA1;
    volatile    uint32_t    SET101_WAY1_DATA2;
    volatile    uint32_t    SET101_WAY1_DATA3;
    volatile    uint32_t    SET102_WAY0_DATA0;
    volatile    uint32_t    SET102_WAY0_DATA1;
    volatile    uint32_t    SET102_WAY0_DATA2;
    volatile    uint32_t    SET102_WAY0_DATA3;
    volatile    uint32_t    SET102_WAY1_DATA0;
    volatile    uint32_t    SET102_WAY1_DATA1;
    volatile    uint32_t    SET102_WAY1_DATA2;
    volatile    uint32_t    SET102_WAY1_DATA3;
    volatile    uint32_t    SET103_WAY0_DATA0;
    volatile    uint32_t    SET103_WAY0_DATA1;
    volatile    uint32_t    SET103_WAY0_DATA2;
    volatile    uint32_t    SET103_WAY0_DATA3;
    volatile    uint32_t    SET103_WAY1_DATA0;
    volatile    uint32_t    SET103_WAY1_DATA1;
    volatile    uint32_t    SET103_WAY1_DATA2;
    volatile    uint32_t    SET103_WAY1_DATA3;
    volatile    uint32_t    SET104_WAY0_DATA0;
    volatile    uint32_t    SET104_WAY0_DATA1;
    volatile    uint32_t    SET104_WAY0_DATA2;
    volatile    uint32_t    SET104_WAY0_DATA3;
    volatile    uint32_t    SET104_WAY1_DATA0;
    volatile    uint32_t    SET104_WAY1_DATA1;
    volatile    uint32_t    SET104_WAY1_DATA2;
    volatile    uint32_t    SET104_WAY1_DATA3;
    volatile    uint32_t    SET105_WAY0_DATA0;
    volatile    uint32_t    SET105_WAY0_DATA1;
    volatile    uint32_t    SET105_WAY0_DATA2;
    volatile    uint32_t    SET105_WAY0_DATA3;
    volatile    uint32_t    SET105_WAY1_DATA0;
    volatile    uint32_t    SET105_WAY1_DATA1;
    volatile    uint32_t    SET105_WAY1_DATA2;
    volatile    uint32_t    SET105_WAY1_DATA3;
    volatile    uint32_t    SET106_WAY0_DATA0;
    volatile    uint32_t    SET106_WAY0_DATA1;
    volatile    uint32_t    SET106_WAY0_DATA2;
    volatile    uint32_t    SET106_WAY0_DATA3;
    volatile    uint32_t    SET106_WAY1_DATA0;
    volatile    uint32_t    SET106_WAY1_DATA1;
    volatile    uint32_t    SET106_WAY1_DATA2;
    volatile    uint32_t    SET106_WAY1_DATA3;
    volatile    uint32_t    SET107_WAY0_DATA0;
    volatile    uint32_t    SET107_WAY0_DATA1;
    volatile    uint32_t    SET107_WAY0_DATA2;
    volatile    uint32_t    SET107_WAY0_DATA3;
    volatile    uint32_t    SET107_WAY1_DATA0;
    volatile    uint32_t    SET107_WAY1_DATA1;
    volatile    uint32_t    SET107_WAY1_DATA2;
    volatile    uint32_t    SET107_WAY1_DATA3;
    volatile    uint32_t    SET108_WAY0_DATA0;
    volatile    uint32_t    SET108_WAY0_DATA1;
    volatile    uint32_t    SET108_WAY0_DATA2;
    volatile    uint32_t    SET108_WAY0_DATA3;
    volatile    uint32_t    SET108_WAY1_DATA0;
    volatile    uint32_t    SET108_WAY1_DATA1;
    volatile    uint32_t    SET108_WAY1_DATA2;
    volatile    uint32_t    SET108_WAY1_DATA3;
    volatile    uint32_t    SET109_WAY0_DATA0;
    volatile    uint32_t    SET109_WAY0_DATA1;
    volatile    uint32_t    SET109_WAY0_DATA2;
    volatile    uint32_t    SET109_WAY0_DATA3;
    volatile    uint32_t    SET109_WAY1_DATA0;
    volatile    uint32_t    SET109_WAY1_DATA1;
    volatile    uint32_t    SET109_WAY1_DATA2;
    volatile    uint32_t    SET109_WAY1_DATA3;
    volatile    uint32_t    SET110_WAY0_DATA0;
    volatile    uint32_t    SET110_WAY0_DATA1;
    volatile    uint32_t    SET110_WAY0_DATA2;
    volatile    uint32_t    SET110_WAY0_DATA3;
    volatile    uint32_t    SET110_WAY1_DATA0;
    volatile    uint32_t    SET110_WAY1_DATA1;
    volatile    uint32_t    SET110_WAY1_DATA2;
    volatile    uint32_t    SET110_WAY1_DATA3;
    volatile    uint32_t    SET111_WAY0_DATA0;
    volatile    uint32_t    SET111_WAY0_DATA1;
    volatile    uint32_t    SET111_WAY0_DATA2;
    volatile    uint32_t    SET111_WAY0_DATA3;
    volatile    uint32_t    SET111_WAY1_DATA0;
    volatile    uint32_t    SET111_WAY1_DATA1;
    volatile    uint32_t    SET111_WAY1_DATA2;
    volatile    uint32_t    SET111_WAY1_DATA3;
    volatile    uint32_t    SET112_WAY0_DATA0;
    volatile    uint32_t    SET112_WAY0_DATA1;
    volatile    uint32_t    SET112_WAY0_DATA2;
    volatile    uint32_t    SET112_WAY0_DATA3;
    volatile    uint32_t    SET112_WAY1_DATA0;
    volatile    uint32_t    SET112_WAY1_DATA1;
    volatile    uint32_t    SET112_WAY1_DATA2;
    volatile    uint32_t    SET112_WAY1_DATA3;
    volatile    uint32_t    SET113_WAY0_DATA0;
    volatile    uint32_t    SET113_WAY0_DATA1;
    volatile    uint32_t    SET113_WAY0_DATA2;
    volatile    uint32_t    SET113_WAY0_DATA3;
    volatile    uint32_t    SET113_WAY1_DATA0;
    volatile    uint32_t    SET113_WAY1_DATA1;
    volatile    uint32_t    SET113_WAY1_DATA2;
    volatile    uint32_t    SET113_WAY1_DATA3;
    volatile    uint32_t    SET114_WAY0_DATA0;
    volatile    uint32_t    SET114_WAY0_DATA1;
    volatile    uint32_t    SET114_WAY0_DATA2;
    volatile    uint32_t    SET114_WAY0_DATA3;
    volatile    uint32_t    SET114_WAY1_DATA0;
    volatile    uint32_t    SET114_WAY1_DATA1;
    volatile    uint32_t    SET114_WAY1_DATA2;
    volatile    uint32_t    SET114_WAY1_DATA3;
    volatile    uint32_t    SET115_WAY0_DATA0;
    volatile    uint32_t    SET115_WAY0_DATA1;
    volatile    uint32_t    SET115_WAY0_DATA2;
    volatile    uint32_t    SET115_WAY0_DATA3;
    volatile    uint32_t    SET115_WAY1_DATA0;
    volatile    uint32_t    SET115_WAY1_DATA1;
    volatile    uint32_t    SET115_WAY1_DATA2;
    volatile    uint32_t    SET115_WAY1_DATA3;
    volatile    uint32_t    SET116_WAY0_DATA0;
    volatile    uint32_t    SET116_WAY0_DATA1;
    volatile    uint32_t    SET116_WAY0_DATA2;
    volatile    uint32_t    SET116_WAY0_DATA3;
    volatile    uint32_t    SET116_WAY1_DATA0;
    volatile    uint32_t    SET116_WAY1_DATA1;
    volatile    uint32_t    SET116_WAY1_DATA2;
    volatile    uint32_t    SET116_WAY1_DATA3;
    volatile    uint32_t    SET117_WAY0_DATA0;
    volatile    uint32_t    SET117_WAY0_DATA1;
    volatile    uint32_t    SET117_WAY0_DATA2;
    volatile    uint32_t    SET117_WAY0_DATA3;
    volatile    uint32_t    SET117_WAY1_DATA0;
    volatile    uint32_t    SET117_WAY1_DATA1;
    volatile    uint32_t    SET117_WAY1_DATA2;
    volatile    uint32_t    SET117_WAY1_DATA3;
    volatile    uint32_t    SET118_WAY0_DATA0;
    volatile    uint32_t    SET118_WAY0_DATA1;
    volatile    uint32_t    SET118_WAY0_DATA2;
    volatile    uint32_t    SET118_WAY0_DATA3;
    volatile    uint32_t    SET118_WAY1_DATA0;
    volatile    uint32_t    SET118_WAY1_DATA1;
    volatile    uint32_t    SET118_WAY1_DATA2;
    volatile    uint32_t    SET118_WAY1_DATA3;
    volatile    uint32_t    SET119_WAY0_DATA0;
    volatile    uint32_t    SET119_WAY0_DATA1;
    volatile    uint32_t    SET119_WAY0_DATA2;
    volatile    uint32_t    SET119_WAY0_DATA3;
    volatile    uint32_t    SET119_WAY1_DATA0;
    volatile    uint32_t    SET119_WAY1_DATA1;
    volatile    uint32_t    SET119_WAY1_DATA2;
    volatile    uint32_t    SET119_WAY1_DATA3;
    volatile    uint32_t    SET120_WAY0_DATA0;
    volatile    uint32_t    SET120_WAY0_DATA1;
    volatile    uint32_t    SET120_WAY0_DATA2;
    volatile    uint32_t    SET120_WAY0_DATA3;
    volatile    uint32_t    SET120_WAY1_DATA0;
    volatile    uint32_t    SET120_WAY1_DATA1;
    volatile    uint32_t    SET120_WAY1_DATA2;
    volatile    uint32_t    SET120_WAY1_DATA3;
    volatile    uint32_t    SET121_WAY0_DATA0;
    volatile    uint32_t    SET121_WAY0_DATA1;
    volatile    uint32_t    SET121_WAY0_DATA2;
    volatile    uint32_t    SET121_WAY0_DATA3;
    volatile    uint32_t    SET121_WAY1_DATA0;
    volatile    uint32_t    SET121_WAY1_DATA1;
    volatile    uint32_t    SET121_WAY1_DATA2;
    volatile    uint32_t    SET121_WAY1_DATA3;
    volatile    uint32_t    SET122_WAY0_DATA0;
    volatile    uint32_t    SET122_WAY0_DATA1;
    volatile    uint32_t    SET122_WAY0_DATA2;
    volatile    uint32_t    SET122_WAY0_DATA3;
    volatile    uint32_t    SET122_WAY1_DATA0;
    volatile    uint32_t    SET122_WAY1_DATA1;
    volatile    uint32_t    SET122_WAY1_DATA2;
    volatile    uint32_t    SET122_WAY1_DATA3;
    volatile    uint32_t    SET123_WAY0_DATA0;
    volatile    uint32_t    SET123_WAY0_DATA1;
    volatile    uint32_t    SET123_WAY0_DATA2;
    volatile    uint32_t    SET123_WAY0_DATA3;
    volatile    uint32_t    SET123_WAY1_DATA0;
    volatile    uint32_t    SET123_WAY1_DATA1;
    volatile    uint32_t    SET123_WAY1_DATA2;
    volatile    uint32_t    SET123_WAY1_DATA3;
    volatile    uint32_t    SET124_WAY0_DATA0;
    volatile    uint32_t    SET124_WAY0_DATA1;
    volatile    uint32_t    SET124_WAY0_DATA2;
    volatile    uint32_t    SET124_WAY0_DATA3;
    volatile    uint32_t    SET124_WAY1_DATA0;
    volatile    uint32_t    SET124_WAY1_DATA1;
    volatile    uint32_t    SET124_WAY1_DATA2;
    volatile    uint32_t    SET124_WAY1_DATA3;
    volatile    uint32_t    SET125_WAY0_DATA0;
    volatile    uint32_t    SET125_WAY0_DATA1;
    volatile    uint32_t    SET125_WAY0_DATA2;
    volatile    uint32_t    SET125_WAY0_DATA3;
    volatile    uint32_t    SET125_WAY1_DATA0;
    volatile    uint32_t    SET125_WAY1_DATA1;
    volatile    uint32_t    SET125_WAY1_DATA2;
    volatile    uint32_t    SET125_WAY1_DATA3;
    volatile    uint32_t    SET126_WAY0_DATA0;
    volatile    uint32_t    SET126_WAY0_DATA1;
    volatile    uint32_t    SET126_WAY0_DATA2;
    volatile    uint32_t    SET126_WAY0_DATA3;
    volatile    uint32_t    SET126_WAY1_DATA0;
    volatile    uint32_t    SET126_WAY1_DATA1;
    volatile    uint32_t    SET126_WAY1_DATA2;
    volatile    uint32_t    SET126_WAY1_DATA3;
    volatile    uint32_t    SET127_WAY0_DATA0;
    volatile    uint32_t    SET127_WAY0_DATA1;
    volatile    uint32_t    SET127_WAY0_DATA2;
    volatile    uint32_t    SET127_WAY0_DATA3;
    volatile    uint32_t    SET127_WAY1_DATA0;
    volatile    uint32_t    SET127_WAY1_DATA1;
    volatile    uint32_t    SET127_WAY1_DATA2;
    volatile    uint32_t    SET127_WAY1_DATA3;
    volatile    uint32_t    SET128_WAY0_DATA0;
