Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_cachedata.h
    volatile    uint32_t    SET128_WAY0_DATA1;
    volatile    uint32_t    SET128_WAY0_DATA2;
    volatile    uint32_t    SET128_WAY0_DATA3;
    volatile    uint32_t    SET128_WAY1_DATA0;
    volatile    uint32_t    SET128_WAY1_DATA1;
    volatile    uint32_t    SET128_WAY1_DATA2;
    volatile    uint32_t    SET128_WAY1_DATA3;
    volatile    uint32_t    SET129_WAY0_DATA0;
    volatile    uint32_t    SET129_WAY0_DATA1;
    volatile    uint32_t    SET129_WAY0_DATA2;
    volatile    uint32_t    SET129_WAY0_DATA3;
    volatile    uint32_t    SET129_WAY1_DATA0;
    volatile    uint32_t    SET129_WAY1_DATA1;
    volatile    uint32_t    SET129_WAY1_DATA2;
    volatile    uint32_t    SET129_WAY1_DATA3;
    volatile    uint32_t    SET130_WAY0_DATA0;
    volatile    uint32_t    SET130_WAY0_DATA1;
    volatile    uint32_t    SET130_WAY0_DATA2;
    volatile    uint32_t    SET130_WAY0_DATA3;
    volatile    uint32_t    SET130_WAY1_DATA0;
    volatile    uint32_t    SET130_WAY1_DATA1;
    volatile    uint32_t    SET130_WAY1_DATA2;
    volatile    uint32_t    SET130_WAY1_DATA3;
    volatile    uint32_t    SET131_WAY0_DATA0;
    volatile    uint32_t    SET131_WAY0_DATA1;
    volatile    uint32_t    SET131_WAY0_DATA2;
    volatile    uint32_t    SET131_WAY0_DATA3;
    volatile    uint32_t    SET131_WAY1_DATA0;
    volatile    uint32_t    SET131_WAY1_DATA1;
    volatile    uint32_t    SET131_WAY1_DATA2;
    volatile    uint32_t    SET131_WAY1_DATA3;
    volatile    uint32_t    SET132_WAY0_DATA0;
    volatile    uint32_t    SET132_WAY0_DATA1;
    volatile    uint32_t    SET132_WAY0_DATA2;
    volatile    uint32_t    SET132_WAY0_DATA3;
    volatile    uint32_t    SET132_WAY1_DATA0;
    volatile    uint32_t    SET132_WAY1_DATA1;
    volatile    uint32_t    SET132_WAY1_DATA2;
    volatile    uint32_t    SET132_WAY1_DATA3;
    volatile    uint32_t    SET133_WAY0_DATA0;
    volatile    uint32_t    SET133_WAY0_DATA1;
    volatile    uint32_t    SET133_WAY0_DATA2;
    volatile    uint32_t    SET133_WAY0_DATA3;
    volatile    uint32_t    SET133_WAY1_DATA0;
    volatile    uint32_t    SET133_WAY1_DATA1;
    volatile    uint32_t    SET133_WAY1_DATA2;
    volatile    uint32_t    SET133_WAY1_DATA3;
    volatile    uint32_t    SET134_WAY0_DATA0;
    volatile    uint32_t    SET134_WAY0_DATA1;
    volatile    uint32_t    SET134_WAY0_DATA2;
    volatile    uint32_t    SET134_WAY0_DATA3;
    volatile    uint32_t    SET134_WAY1_DATA0;
    volatile    uint32_t    SET134_WAY1_DATA1;
    volatile    uint32_t    SET134_WAY1_DATA2;
    volatile    uint32_t    SET134_WAY1_DATA3;
    volatile    uint32_t    SET135_WAY0_DATA0;
    volatile    uint32_t    SET135_WAY0_DATA1;
    volatile    uint32_t    SET135_WAY0_DATA2;
    volatile    uint32_t    SET135_WAY0_DATA3;
    volatile    uint32_t    SET135_WAY1_DATA0;
    volatile    uint32_t    SET135_WAY1_DATA1;
    volatile    uint32_t    SET135_WAY1_DATA2;
    volatile    uint32_t    SET135_WAY1_DATA3;
    volatile    uint32_t    SET136_WAY0_DATA0;
    volatile    uint32_t    SET136_WAY0_DATA1;
    volatile    uint32_t    SET136_WAY0_DATA2;
    volatile    uint32_t    SET136_WAY0_DATA3;
    volatile    uint32_t    SET136_WAY1_DATA0;
    volatile    uint32_t    SET136_WAY1_DATA1;
    volatile    uint32_t    SET136_WAY1_DATA2;
    volatile    uint32_t    SET136_WAY1_DATA3;
    volatile    uint32_t    SET137_WAY0_DATA0;
    volatile    uint32_t    SET137_WAY0_DATA1;
    volatile    uint32_t    SET137_WAY0_DATA2;
    volatile    uint32_t    SET137_WAY0_DATA3;
    volatile    uint32_t    SET137_WAY1_DATA0;
    volatile    uint32_t    SET137_WAY1_DATA1;
    volatile    uint32_t    SET137_WAY1_DATA2;
    volatile    uint32_t    SET137_WAY1_DATA3;
    volatile    uint32_t    SET138_WAY0_DATA0;
    volatile    uint32_t    SET138_WAY0_DATA1;
    volatile    uint32_t    SET138_WAY0_DATA2;
    volatile    uint32_t    SET138_WAY0_DATA3;
    volatile    uint32_t    SET138_WAY1_DATA0;
    volatile    uint32_t    SET138_WAY1_DATA1;
    volatile    uint32_t    SET138_WAY1_DATA2;
    volatile    uint32_t    SET138_WAY1_DATA3;
    volatile    uint32_t    SET139_WAY0_DATA0;
    volatile    uint32_t    SET139_WAY0_DATA1;
    volatile    uint32_t    SET139_WAY0_DATA2;
    volatile    uint32_t    SET139_WAY0_DATA3;
    volatile    uint32_t    SET139_WAY1_DATA0;
    volatile    uint32_t    SET139_WAY1_DATA1;
    volatile    uint32_t    SET139_WAY1_DATA2;
    volatile    uint32_t    SET139_WAY1_DATA3;
    volatile    uint32_t    SET140_WAY0_DATA0;
    volatile    uint32_t    SET140_WAY0_DATA1;
    volatile    uint32_t    SET140_WAY0_DATA2;
    volatile    uint32_t    SET140_WAY0_DATA3;
    volatile    uint32_t    SET140_WAY1_DATA0;
    volatile    uint32_t    SET140_WAY1_DATA1;
    volatile    uint32_t    SET140_WAY1_DATA2;
    volatile    uint32_t    SET140_WAY1_DATA3;
    volatile    uint32_t    SET141_WAY0_DATA0;
    volatile    uint32_t    SET141_WAY0_DATA1;
    volatile    uint32_t    SET141_WAY0_DATA2;
    volatile    uint32_t    SET141_WAY0_DATA3;
    volatile    uint32_t    SET141_WAY1_DATA0;
    volatile    uint32_t    SET141_WAY1_DATA1;
    volatile    uint32_t    SET141_WAY1_DATA2;
    volatile    uint32_t    SET141_WAY1_DATA3;
    volatile    uint32_t    SET142_WAY0_DATA0;
    volatile    uint32_t    SET142_WAY0_DATA1;
    volatile    uint32_t    SET142_WAY0_DATA2;
    volatile    uint32_t    SET142_WAY0_DATA3;
    volatile    uint32_t    SET142_WAY1_DATA0;
    volatile    uint32_t    SET142_WAY1_DATA1;
    volatile    uint32_t    SET142_WAY1_DATA2;
    volatile    uint32_t    SET142_WAY1_DATA3;
    volatile    uint32_t    SET143_WAY0_DATA0;
    volatile    uint32_t    SET143_WAY0_DATA1;
    volatile    uint32_t    SET143_WAY0_DATA2;
    volatile    uint32_t    SET143_WAY0_DATA3;
    volatile    uint32_t    SET143_WAY1_DATA0;
    volatile    uint32_t    SET143_WAY1_DATA1;
    volatile    uint32_t    SET143_WAY1_DATA2;
    volatile    uint32_t    SET143_WAY1_DATA3;
    volatile    uint32_t    SET144_WAY0_DATA0;
    volatile    uint32_t    SET144_WAY0_DATA1;
    volatile    uint32_t    SET144_WAY0_DATA2;
    volatile    uint32_t    SET144_WAY0_DATA3;
    volatile    uint32_t    SET144_WAY1_DATA0;
    volatile    uint32_t    SET144_WAY1_DATA1;
    volatile    uint32_t    SET144_WAY1_DATA2;
    volatile    uint32_t    SET144_WAY1_DATA3;
    volatile    uint32_t    SET145_WAY0_DATA0;
    volatile    uint32_t    SET145_WAY0_DATA1;
    volatile    uint32_t    SET145_WAY0_DATA2;
    volatile    uint32_t    SET145_WAY0_DATA3;
    volatile    uint32_t    SET145_WAY1_DATA0;
    volatile    uint32_t    SET145_WAY1_DATA1;
    volatile    uint32_t    SET145_WAY1_DATA2;
    volatile    uint32_t    SET145_WAY1_DATA3;
    volatile    uint32_t    SET146_WAY0_DATA0;
    volatile    uint32_t    SET146_WAY0_DATA1;
    volatile    uint32_t    SET146_WAY0_DATA2;
    volatile    uint32_t    SET146_WAY0_DATA3;
    volatile    uint32_t    SET146_WAY1_DATA0;
    volatile    uint32_t    SET146_WAY1_DATA1;
    volatile    uint32_t    SET146_WAY1_DATA2;
    volatile    uint32_t    SET146_WAY1_DATA3;
    volatile    uint32_t    SET147_WAY0_DATA0;
    volatile    uint32_t    SET147_WAY0_DATA1;
    volatile    uint32_t    SET147_WAY0_DATA2;
    volatile    uint32_t    SET147_WAY0_DATA3;
    volatile    uint32_t    SET147_WAY1_DATA0;
    volatile    uint32_t    SET147_WAY1_DATA1;
    volatile    uint32_t    SET147_WAY1_DATA2;
    volatile    uint32_t    SET147_WAY1_DATA3;
    volatile    uint32_t    SET148_WAY0_DATA0;
    volatile    uint32_t    SET148_WAY0_DATA1;
    volatile    uint32_t    SET148_WAY0_DATA2;
    volatile    uint32_t    SET148_WAY0_DATA3;
    volatile    uint32_t    SET148_WAY1_DATA0;
    volatile    uint32_t    SET148_WAY1_DATA1;
    volatile    uint32_t    SET148_WAY1_DATA2;
    volatile    uint32_t    SET148_WAY1_DATA3;
    volatile    uint32_t    SET149_WAY0_DATA0;
    volatile    uint32_t    SET149_WAY0_DATA1;
    volatile    uint32_t    SET149_WAY0_DATA2;
    volatile    uint32_t    SET149_WAY0_DATA3;
    volatile    uint32_t    SET149_WAY1_DATA0;
    volatile    uint32_t    SET149_WAY1_DATA1;
    volatile    uint32_t    SET149_WAY1_DATA2;
    volatile    uint32_t    SET149_WAY1_DATA3;
    volatile    uint32_t    SET150_WAY0_DATA0;
    volatile    uint32_t    SET150_WAY0_DATA1;
    volatile    uint32_t    SET150_WAY0_DATA2;
    volatile    uint32_t    SET150_WAY0_DATA3;
    volatile    uint32_t    SET150_WAY1_DATA0;
    volatile    uint32_t    SET150_WAY1_DATA1;
    volatile    uint32_t    SET150_WAY1_DATA2;
    volatile    uint32_t    SET150_WAY1_DATA3;
    volatile    uint32_t    SET151_WAY0_DATA0;
    volatile    uint32_t    SET151_WAY0_DATA1;
    volatile    uint32_t    SET151_WAY0_DATA2;
    volatile    uint32_t    SET151_WAY0_DATA3;
    volatile    uint32_t    SET151_WAY1_DATA0;
    volatile    uint32_t    SET151_WAY1_DATA1;
    volatile    uint32_t    SET151_WAY1_DATA2;
    volatile    uint32_t    SET151_WAY1_DATA3;
    volatile    uint32_t    SET152_WAY0_DATA0;
    volatile    uint32_t    SET152_WAY0_DATA1;
    volatile    uint32_t    SET152_WAY0_DATA2;
    volatile    uint32_t    SET152_WAY0_DATA3;
    volatile    uint32_t    SET152_WAY1_DATA0;
    volatile    uint32_t    SET152_WAY1_DATA1;
    volatile    uint32_t    SET152_WAY1_DATA2;
    volatile    uint32_t    SET152_WAY1_DATA3;
    volatile    uint32_t    SET153_WAY0_DATA0;
    volatile    uint32_t    SET153_WAY0_DATA1;
    volatile    uint32_t    SET153_WAY0_DATA2;
    volatile    uint32_t    SET153_WAY0_DATA3;
    volatile    uint32_t    SET153_WAY1_DATA0;
    volatile    uint32_t    SET153_WAY1_DATA1;
    volatile    uint32_t    SET153_WAY1_DATA2;
    volatile    uint32_t    SET153_WAY1_DATA3;
    volatile    uint32_t    SET154_WAY0_DATA0;
    volatile    uint32_t    SET154_WAY0_DATA1;
    volatile    uint32_t    SET154_WAY0_DATA2;
    volatile    uint32_t    SET154_WAY0_DATA3;
    volatile    uint32_t    SET154_WAY1_DATA0;
    volatile    uint32_t    SET154_WAY1_DATA1;
    volatile    uint32_t    SET154_WAY1_DATA2;
    volatile    uint32_t    SET154_WAY1_DATA3;
    volatile    uint32_t    SET155_WAY0_DATA0;
    volatile    uint32_t    SET155_WAY0_DATA1;
    volatile    uint32_t    SET155_WAY0_DATA2;
    volatile    uint32_t    SET155_WAY0_DATA3;
    volatile    uint32_t    SET155_WAY1_DATA0;
    volatile    uint32_t    SET155_WAY1_DATA1;
    volatile    uint32_t    SET155_WAY1_DATA2;
    volatile    uint32_t    SET155_WAY1_DATA3;
    volatile    uint32_t    SET156_WAY0_DATA0;
    volatile    uint32_t    SET156_WAY0_DATA1;
    volatile    uint32_t    SET156_WAY0_DATA2;
    volatile    uint32_t    SET156_WAY0_DATA3;
    volatile    uint32_t    SET156_WAY1_DATA0;
    volatile    uint32_t    SET156_WAY1_DATA1;
    volatile    uint32_t    SET156_WAY1_DATA2;
    volatile    uint32_t    SET156_WAY1_DATA3;
    volatile    uint32_t    SET157_WAY0_DATA0;
    volatile    uint32_t    SET157_WAY0_DATA1;
    volatile    uint32_t    SET157_WAY0_DATA2;
    volatile    uint32_t    SET157_WAY0_DATA3;
    volatile    uint32_t    SET157_WAY1_DATA0;
    volatile    uint32_t    SET157_WAY1_DATA1;
    volatile    uint32_t    SET157_WAY1_DATA2;
    volatile    uint32_t    SET157_WAY1_DATA3;
    volatile    uint32_t    SET158_WAY0_DATA0;
    volatile    uint32_t    SET158_WAY0_DATA1;
    volatile    uint32_t    SET158_WAY0_DATA2;
    volatile    uint32_t    SET158_WAY0_DATA3;
    volatile    uint32_t    SET158_WAY1_DATA0;
    volatile    uint32_t    SET158_WAY1_DATA1;
    volatile    uint32_t    SET158_WAY1_DATA2;
    volatile    uint32_t    SET158_WAY1_DATA3;
    volatile    uint32_t    SET159_WAY0_DATA0;
    volatile    uint32_t    SET159_WAY0_DATA1;
    volatile    uint32_t    SET159_WAY0_DATA2;
    volatile    uint32_t    SET159_WAY0_DATA3;
    volatile    uint32_t    SET159_WAY1_DATA0;
    volatile    uint32_t    SET159_WAY1_DATA1;
    volatile    uint32_t    SET159_WAY1_DATA2;
    volatile    uint32_t    SET159_WAY1_DATA3;
    volatile    uint32_t    SET160_WAY0_DATA0;
    volatile    uint32_t    SET160_WAY0_DATA1;
    volatile    uint32_t    SET160_WAY0_DATA2;
    volatile    uint32_t    SET160_WAY0_DATA3;
    volatile    uint32_t    SET160_WAY1_DATA0;
    volatile    uint32_t    SET160_WAY1_DATA1;
    volatile    uint32_t    SET160_WAY1_DATA2;
    volatile    uint32_t    SET160_WAY1_DATA3;
    volatile    uint32_t    SET161_WAY0_DATA0;
    volatile    uint32_t    SET161_WAY0_DATA1;
    volatile    uint32_t    SET161_WAY0_DATA2;
    volatile    uint32_t    SET161_WAY0_DATA3;
    volatile    uint32_t    SET161_WAY1_DATA0;
    volatile    uint32_t    SET161_WAY1_DATA1;
    volatile    uint32_t    SET161_WAY1_DATA2;
    volatile    uint32_t    SET161_WAY1_DATA3;
    volatile    uint32_t    SET162_WAY0_DATA0;
    volatile    uint32_t    SET162_WAY0_DATA1;
    volatile    uint32_t    SET162_WAY0_DATA2;
    volatile    uint32_t    SET162_WAY0_DATA3;
    volatile    uint32_t    SET162_WAY1_DATA0;
    volatile    uint32_t    SET162_WAY1_DATA1;
    volatile    uint32_t    SET162_WAY1_DATA2;
    volatile    uint32_t    SET162_WAY1_DATA3;
    volatile    uint32_t    SET163_WAY0_DATA0;
    volatile    uint32_t    SET163_WAY0_DATA1;
    volatile    uint32_t    SET163_WAY0_DATA2;
    volatile    uint32_t    SET163_WAY0_DATA3;
    volatile    uint32_t    SET163_WAY1_DATA0;
    volatile    uint32_t    SET163_WAY1_DATA1;
    volatile    uint32_t    SET163_WAY1_DATA2;
    volatile    uint32_t    SET163_WAY1_DATA3;
    volatile    uint32_t    SET164_WAY0_DATA0;
    volatile    uint32_t    SET164_WAY0_DATA1;
    volatile    uint32_t    SET164_WAY0_DATA2;
    volatile    uint32_t    SET164_WAY0_DATA3;
    volatile    uint32_t    SET164_WAY1_DATA0;
    volatile    uint32_t    SET164_WAY1_DATA1;
    volatile    uint32_t    SET164_WAY1_DATA2;
    volatile    uint32_t    SET164_WAY1_DATA3;
    volatile    uint32_t    SET165_WAY0_DATA0;
    volatile    uint32_t    SET165_WAY0_DATA1;
    volatile    uint32_t    SET165_WAY0_DATA2;
    volatile    uint32_t    SET165_WAY0_DATA3;
    volatile    uint32_t    SET165_WAY1_DATA0;
    volatile    uint32_t    SET165_WAY1_DATA1;
    volatile    uint32_t    SET165_WAY1_DATA2;
    volatile    uint32_t    SET165_WAY1_DATA3;
    volatile    uint32_t    SET166_WAY0_DATA0;
    volatile    uint32_t    SET166_WAY0_DATA1;
    volatile    uint32_t    SET166_WAY0_DATA2;
    volatile    uint32_t    SET166_WAY0_DATA3;
    volatile    uint32_t    SET166_WAY1_DATA0;
    volatile    uint32_t    SET166_WAY1_DATA1;
    volatile    uint32_t    SET166_WAY1_DATA2;
    volatile    uint32_t    SET166_WAY1_DATA3;
    volatile    uint32_t    SET167_WAY0_DATA0;
    volatile    uint32_t    SET167_WAY0_DATA1;
    volatile    uint32_t    SET167_WAY0_DATA2;
    volatile    uint32_t    SET167_WAY0_DATA3;
    volatile    uint32_t    SET167_WAY1_DATA0;
    volatile    uint32_t    SET167_WAY1_DATA1;
    volatile    uint32_t    SET167_WAY1_DATA2;
    volatile    uint32_t    SET167_WAY1_DATA3;
    volatile    uint32_t    SET168_WAY0_DATA0;
    volatile    uint32_t    SET168_WAY0_DATA1;
    volatile    uint32_t    SET168_WAY0_DATA2;
    volatile    uint32_t    SET168_WAY0_DATA3;
    volatile    uint32_t    SET168_WAY1_DATA0;
    volatile    uint32_t    SET168_WAY1_DATA1;
    volatile    uint32_t    SET168_WAY1_DATA2;
    volatile    uint32_t    SET168_WAY1_DATA3;
    volatile    uint32_t    SET169_WAY0_DATA0;
    volatile    uint32_t    SET169_WAY0_DATA1;
    volatile    uint32_t    SET169_WAY0_DATA2;
    volatile    uint32_t    SET169_WAY0_DATA3;
    volatile    uint32_t    SET169_WAY1_DATA0;
    volatile    uint32_t    SET169_WAY1_DATA1;
    volatile    uint32_t    SET169_WAY1_DATA2;
    volatile    uint32_t    SET169_WAY1_DATA3;
    volatile    uint32_t    SET170_WAY0_DATA0;
    volatile    uint32_t    SET170_WAY0_DATA1;
    volatile    uint32_t    SET170_WAY0_DATA2;
    volatile    uint32_t    SET170_WAY0_DATA3;
    volatile    uint32_t    SET170_WAY1_DATA0;
    volatile    uint32_t    SET170_WAY1_DATA1;
    volatile    uint32_t    SET170_WAY1_DATA2;
    volatile    uint32_t    SET170_WAY1_DATA3;
    volatile    uint32_t    SET171_WAY0_DATA0;
    volatile    uint32_t    SET171_WAY0_DATA1;
    volatile    uint32_t    SET171_WAY0_DATA2;
    volatile    uint32_t    SET171_WAY0_DATA3;
    volatile    uint32_t    SET171_WAY1_DATA0;
    volatile    uint32_t    SET171_WAY1_DATA1;
    volatile    uint32_t    SET171_WAY1_DATA2;
    volatile    uint32_t    SET171_WAY1_DATA3;
    volatile    uint32_t    SET172_WAY0_DATA0;
    volatile    uint32_t    SET172_WAY0_DATA1;
    volatile    uint32_t    SET172_WAY0_DATA2;
    volatile    uint32_t    SET172_WAY0_DATA3;
    volatile    uint32_t    SET172_WAY1_DATA0;
    volatile    uint32_t    SET172_WAY1_DATA1;
    volatile    uint32_t    SET172_WAY1_DATA2;
    volatile    uint32_t    SET172_WAY1_DATA3;
    volatile    uint32_t    SET173_WAY0_DATA0;
    volatile    uint32_t    SET173_WAY0_DATA1;
    volatile    uint32_t    SET173_WAY0_DATA2;
    volatile    uint32_t    SET173_WAY0_DATA3;
    volatile    uint32_t    SET173_WAY1_DATA0;
    volatile    uint32_t    SET173_WAY1_DATA1;
    volatile    uint32_t    SET173_WAY1_DATA2;
    volatile    uint32_t    SET173_WAY1_DATA3;
    volatile    uint32_t    SET174_WAY0_DATA0;
    volatile    uint32_t    SET174_WAY0_DATA1;
    volatile    uint32_t    SET174_WAY0_DATA2;
    volatile    uint32_t    SET174_WAY0_DATA3;
    volatile    uint32_t    SET174_WAY1_DATA0;
    volatile    uint32_t    SET174_WAY1_DATA1;
    volatile    uint32_t    SET174_WAY1_DATA2;
    volatile    uint32_t    SET174_WAY1_DATA3;
    volatile    uint32_t    SET175_WAY0_DATA0;
    volatile    uint32_t    SET175_WAY0_DATA1;
    volatile    uint32_t    SET175_WAY0_DATA2;
    volatile    uint32_t    SET175_WAY0_DATA3;
    volatile    uint32_t    SET175_WAY1_DATA0;
    volatile    uint32_t    SET175_WAY1_DATA1;
    volatile    uint32_t    SET175_WAY1_DATA2;
    volatile    uint32_t    SET175_WAY1_DATA3;
    volatile    uint32_t    SET176_WAY0_DATA0;
    volatile    uint32_t    SET176_WAY0_DATA1;
    volatile    uint32_t    SET176_WAY0_DATA2;
    volatile    uint32_t    SET176_WAY0_DATA3;
    volatile    uint32_t    SET176_WAY1_DATA0;
    volatile    uint32_t    SET176_WAY1_DATA1;
    volatile    uint32_t    SET176_WAY1_DATA2;
    volatile    uint32_t    SET176_WAY1_DATA3;
    volatile    uint32_t    SET177_WAY0_DATA0;
    volatile    uint32_t    SET177_WAY0_DATA1;
    volatile    uint32_t    SET177_WAY0_DATA2;
    volatile    uint32_t    SET177_WAY0_DATA3;
    volatile    uint32_t    SET177_WAY1_DATA0;
    volatile    uint32_t    SET177_WAY1_DATA1;
    volatile    uint32_t    SET177_WAY1_DATA2;
    volatile    uint32_t    SET177_WAY1_DATA3;
    volatile    uint32_t    SET178_WAY0_DATA0;
    volatile    uint32_t    SET178_WAY0_DATA1;
    volatile    uint32_t    SET178_WAY0_DATA2;
    volatile    uint32_t    SET178_WAY0_DATA3;
    volatile    uint32_t    SET178_WAY1_DATA0;
    volatile    uint32_t    SET178_WAY1_DATA1;
    volatile    uint32_t    SET178_WAY1_DATA2;
    volatile    uint32_t    SET178_WAY1_DATA3;
    volatile    uint32_t    SET179_WAY0_DATA0;
    volatile    uint32_t    SET179_WAY0_DATA1;
    volatile    uint32_t    SET179_WAY0_DATA2;
    volatile    uint32_t    SET179_WAY0_DATA3;
    volatile    uint32_t    SET179_WAY1_DATA0;
    volatile    uint32_t    SET179_WAY1_DATA1;
    volatile    uint32_t    SET179_WAY1_DATA2;
    volatile    uint32_t    SET179_WAY1_DATA3;
    volatile    uint32_t    SET180_WAY0_DATA0;
    volatile    uint32_t    SET180_WAY0_DATA1;
    volatile    uint32_t    SET180_WAY0_DATA2;
    volatile    uint32_t    SET180_WAY0_DATA3;
    volatile    uint32_t    SET180_WAY1_DATA0;
    volatile    uint32_t    SET180_WAY1_DATA1;
    volatile    uint32_t    SET180_WAY1_DATA2;
    volatile    uint32_t    SET180_WAY1_DATA3;
    volatile    uint32_t    SET181_WAY0_DATA0;
    volatile    uint32_t    SET181_WAY0_DATA1;
    volatile    uint32_t    SET181_WAY0_DATA2;
    volatile    uint32_t    SET181_WAY0_DATA3;
    volatile    uint32_t    SET181_WAY1_DATA0;
    volatile    uint32_t    SET181_WAY1_DATA1;
    volatile    uint32_t    SET181_WAY1_DATA2;
    volatile    uint32_t    SET181_WAY1_DATA3;
    volatile    uint32_t    SET182_WAY0_DATA0;
    volatile    uint32_t    SET182_WAY0_DATA1;
    volatile    uint32_t    SET182_WAY0_DATA2;
    volatile    uint32_t    SET182_WAY0_DATA3;
    volatile    uint32_t    SET182_WAY1_DATA0;
    volatile    uint32_t    SET182_WAY1_DATA1;
    volatile    uint32_t    SET182_WAY1_DATA2;
    volatile    uint32_t    SET182_WAY1_DATA3;
    volatile    uint32_t    SET183_WAY0_DATA0;
    volatile    uint32_t    SET183_WAY0_DATA1;
    volatile    uint32_t    SET183_WAY0_DATA2;
    volatile    uint32_t    SET183_WAY0_DATA3;
    volatile    uint32_t    SET183_WAY1_DATA0;
    volatile    uint32_t    SET183_WAY1_DATA1;
    volatile    uint32_t    SET183_WAY1_DATA2;
    volatile    uint32_t    SET183_WAY1_DATA3;
    volatile    uint32_t    SET184_WAY0_DATA0;
    volatile    uint32_t    SET184_WAY0_DATA1;
    volatile    uint32_t    SET184_WAY0_DATA2;
    volatile    uint32_t    SET184_WAY0_DATA3;
    volatile    uint32_t    SET184_WAY1_DATA0;
    volatile    uint32_t    SET184_WAY1_DATA1;
    volatile    uint32_t    SET184_WAY1_DATA2;
    volatile    uint32_t    SET184_WAY1_DATA3;
    volatile    uint32_t    SET185_WAY0_DATA0;
    volatile    uint32_t    SET185_WAY0_DATA1;
    volatile    uint32_t    SET185_WAY0_DATA2;
    volatile    uint32_t    SET185_WAY0_DATA3;
    volatile    uint32_t    SET185_WAY1_DATA0;
    volatile    uint32_t    SET185_WAY1_DATA1;
    volatile    uint32_t    SET185_WAY1_DATA2;
    volatile    uint32_t    SET185_WAY1_DATA3;
    volatile    uint32_t    SET186_WAY0_DATA0;
    volatile    uint32_t    SET186_WAY0_DATA1;
    volatile    uint32_t    SET186_WAY0_DATA2;
    volatile    uint32_t    SET186_WAY0_DATA3;
    volatile    uint32_t    SET186_WAY1_DATA0;
    volatile    uint32_t    SET186_WAY1_DATA1;
    volatile    uint32_t    SET186_WAY1_DATA2;
    volatile    uint32_t    SET186_WAY1_DATA3;
    volatile    uint32_t    SET187_WAY0_DATA0;
    volatile    uint32_t    SET187_WAY0_DATA1;
    volatile    uint32_t    SET187_WAY0_DATA2;
    volatile    uint32_t    SET187_WAY0_DATA3;
    volatile    uint32_t    SET187_WAY1_DATA0;
    volatile    uint32_t    SET187_WAY1_DATA1;
    volatile    uint32_t    SET187_WAY1_DATA2;
    volatile    uint32_t    SET187_WAY1_DATA3;
    volatile    uint32_t    SET188_WAY0_DATA0;
    volatile    uint32_t    SET188_WAY0_DATA1;
    volatile    uint32_t    SET188_WAY0_DATA2;
    volatile    uint32_t    SET188_WAY0_DATA3;
    volatile    uint32_t    SET188_WAY1_DATA0;
    volatile    uint32_t    SET188_WAY1_DATA1;
    volatile    uint32_t    SET188_WAY1_DATA2;
    volatile    uint32_t    SET188_WAY1_DATA3;
    volatile    uint32_t    SET189_WAY0_DATA0;
    volatile    uint32_t    SET189_WAY0_DATA1;
    volatile    uint32_t    SET189_WAY0_DATA2;
    volatile    uint32_t    SET189_WAY0_DATA3;
    volatile    uint32_t    SET189_WAY1_DATA0;
    volatile    uint32_t    SET189_WAY1_DATA1;
    volatile    uint32_t    SET189_WAY1_DATA2;
    volatile    uint32_t    SET189_WAY1_DATA3;
    volatile    uint32_t    SET190_WAY0_DATA0;
    volatile    uint32_t    SET190_WAY0_DATA1;
    volatile    uint32_t    SET190_WAY0_DATA2;
    volatile    uint32_t    SET190_WAY0_DATA3;
    volatile    uint32_t    SET190_WAY1_DATA0;
    volatile    uint32_t    SET190_WAY1_DATA1;
    volatile    uint32_t    SET190_WAY1_DATA2;
    volatile    uint32_t    SET190_WAY1_DATA3;
    volatile    uint32_t    SET191_WAY0_DATA0;
    volatile    uint32_t    SET191_WAY0_DATA1;
    volatile    uint32_t    SET191_WAY0_DATA2;
    volatile    uint32_t    SET191_WAY0_DATA3;
    volatile    uint32_t    SET191_WAY1_DATA0;
    volatile    uint32_t    SET191_WAY1_DATA1;
    volatile    uint32_t    SET191_WAY1_DATA2;
