Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_cachedata.h
    volatile    uint32_t    SET191_WAY1_DATA3;
    volatile    uint32_t    SET192_WAY0_DATA0;
    volatile    uint32_t    SET192_WAY0_DATA1;
    volatile    uint32_t    SET192_WAY0_DATA2;
    volatile    uint32_t    SET192_WAY0_DATA3;
    volatile    uint32_t    SET192_WAY1_DATA0;
    volatile    uint32_t    SET192_WAY1_DATA1;
    volatile    uint32_t    SET192_WAY1_DATA2;
    volatile    uint32_t    SET192_WAY1_DATA3;
    volatile    uint32_t    SET193_WAY0_DATA0;
    volatile    uint32_t    SET193_WAY0_DATA1;
    volatile    uint32_t    SET193_WAY0_DATA2;
    volatile    uint32_t    SET193_WAY0_DATA3;
    volatile    uint32_t    SET193_WAY1_DATA0;
    volatile    uint32_t    SET193_WAY1_DATA1;
    volatile    uint32_t    SET193_WAY1_DATA2;
    volatile    uint32_t    SET193_WAY1_DATA3;
    volatile    uint32_t    SET194_WAY0_DATA0;
    volatile    uint32_t    SET194_WAY0_DATA1;
    volatile    uint32_t    SET194_WAY0_DATA2;
    volatile    uint32_t    SET194_WAY0_DATA3;
    volatile    uint32_t    SET194_WAY1_DATA0;
    volatile    uint32_t    SET194_WAY1_DATA1;
    volatile    uint32_t    SET194_WAY1_DATA2;
    volatile    uint32_t    SET194_WAY1_DATA3;
    volatile    uint32_t    SET195_WAY0_DATA0;
    volatile    uint32_t    SET195_WAY0_DATA1;
    volatile    uint32_t    SET195_WAY0_DATA2;
    volatile    uint32_t    SET195_WAY0_DATA3;
    volatile    uint32_t    SET195_WAY1_DATA0;
    volatile    uint32_t    SET195_WAY1_DATA1;
    volatile    uint32_t    SET195_WAY1_DATA2;
    volatile    uint32_t    SET195_WAY1_DATA3;
    volatile    uint32_t    SET196_WAY0_DATA0;
    volatile    uint32_t    SET196_WAY0_DATA1;
    volatile    uint32_t    SET196_WAY0_DATA2;
    volatile    uint32_t    SET196_WAY0_DATA3;
    volatile    uint32_t    SET196_WAY1_DATA0;
    volatile    uint32_t    SET196_WAY1_DATA1;
    volatile    uint32_t    SET196_WAY1_DATA2;
    volatile    uint32_t    SET196_WAY1_DATA3;
    volatile    uint32_t    SET197_WAY0_DATA0;
    volatile    uint32_t    SET197_WAY0_DATA1;
    volatile    uint32_t    SET197_WAY0_DATA2;
    volatile    uint32_t    SET197_WAY0_DATA3;
    volatile    uint32_t    SET197_WAY1_DATA0;
    volatile    uint32_t    SET197_WAY1_DATA1;
    volatile    uint32_t    SET197_WAY1_DATA2;
    volatile    uint32_t    SET197_WAY1_DATA3;
    volatile    uint32_t    SET198_WAY0_DATA0;
    volatile    uint32_t    SET198_WAY0_DATA1;
    volatile    uint32_t    SET198_WAY0_DATA2;
    volatile    uint32_t    SET198_WAY0_DATA3;
    volatile    uint32_t    SET198_WAY1_DATA0;
    volatile    uint32_t    SET198_WAY1_DATA1;
    volatile    uint32_t    SET198_WAY1_DATA2;
    volatile    uint32_t    SET198_WAY1_DATA3;
    volatile    uint32_t    SET199_WAY0_DATA0;
    volatile    uint32_t    SET199_WAY0_DATA1;
    volatile    uint32_t    SET199_WAY0_DATA2;
    volatile    uint32_t    SET199_WAY0_DATA3;
    volatile    uint32_t    SET199_WAY1_DATA0;
    volatile    uint32_t    SET199_WAY1_DATA1;
    volatile    uint32_t    SET199_WAY1_DATA2;
    volatile    uint32_t    SET199_WAY1_DATA3;
    volatile    uint32_t    SET200_WAY0_DATA0;
    volatile    uint32_t    SET200_WAY0_DATA1;
    volatile    uint32_t    SET200_WAY0_DATA2;
    volatile    uint32_t    SET200_WAY0_DATA3;
    volatile    uint32_t    SET200_WAY1_DATA0;
    volatile    uint32_t    SET200_WAY1_DATA1;
    volatile    uint32_t    SET200_WAY1_DATA2;
    volatile    uint32_t    SET200_WAY1_DATA3;
    volatile    uint32_t    SET201_WAY0_DATA0;
    volatile    uint32_t    SET201_WAY0_DATA1;
    volatile    uint32_t    SET201_WAY0_DATA2;
    volatile    uint32_t    SET201_WAY0_DATA3;
    volatile    uint32_t    SET201_WAY1_DATA0;
    volatile    uint32_t    SET201_WAY1_DATA1;
    volatile    uint32_t    SET201_WAY1_DATA2;
    volatile    uint32_t    SET201_WAY1_DATA3;
    volatile    uint32_t    SET202_WAY0_DATA0;
    volatile    uint32_t    SET202_WAY0_DATA1;
    volatile    uint32_t    SET202_WAY0_DATA2;
    volatile    uint32_t    SET202_WAY0_DATA3;
    volatile    uint32_t    SET202_WAY1_DATA0;
    volatile    uint32_t    SET202_WAY1_DATA1;
    volatile    uint32_t    SET202_WAY1_DATA2;
    volatile    uint32_t    SET202_WAY1_DATA3;
    volatile    uint32_t    SET203_WAY0_DATA0;
    volatile    uint32_t    SET203_WAY0_DATA1;
    volatile    uint32_t    SET203_WAY0_DATA2;
    volatile    uint32_t    SET203_WAY0_DATA3;
    volatile    uint32_t    SET203_WAY1_DATA0;
    volatile    uint32_t    SET203_WAY1_DATA1;
    volatile    uint32_t    SET203_WAY1_DATA2;
    volatile    uint32_t    SET203_WAY1_DATA3;
    volatile    uint32_t    SET204_WAY0_DATA0;
    volatile    uint32_t    SET204_WAY0_DATA1;
    volatile    uint32_t    SET204_WAY0_DATA2;
    volatile    uint32_t    SET204_WAY0_DATA3;
    volatile    uint32_t    SET204_WAY1_DATA0;
    volatile    uint32_t    SET204_WAY1_DATA1;
    volatile    uint32_t    SET204_WAY1_DATA2;
    volatile    uint32_t    SET204_WAY1_DATA3;
    volatile    uint32_t    SET205_WAY0_DATA0;
    volatile    uint32_t    SET205_WAY0_DATA1;
    volatile    uint32_t    SET205_WAY0_DATA2;
    volatile    uint32_t    SET205_WAY0_DATA3;
    volatile    uint32_t    SET205_WAY1_DATA0;
    volatile    uint32_t    SET205_WAY1_DATA1;
    volatile    uint32_t    SET205_WAY1_DATA2;
    volatile    uint32_t    SET205_WAY1_DATA3;
    volatile    uint32_t    SET206_WAY0_DATA0;
    volatile    uint32_t    SET206_WAY0_DATA1;
    volatile    uint32_t    SET206_WAY0_DATA2;
    volatile    uint32_t    SET206_WAY0_DATA3;
    volatile    uint32_t    SET206_WAY1_DATA0;
    volatile    uint32_t    SET206_WAY1_DATA1;
    volatile    uint32_t    SET206_WAY1_DATA2;
    volatile    uint32_t    SET206_WAY1_DATA3;
    volatile    uint32_t    SET207_WAY0_DATA0;
    volatile    uint32_t    SET207_WAY0_DATA1;
    volatile    uint32_t    SET207_WAY0_DATA2;
    volatile    uint32_t    SET207_WAY0_DATA3;
    volatile    uint32_t    SET207_WAY1_DATA0;
    volatile    uint32_t    SET207_WAY1_DATA1;
    volatile    uint32_t    SET207_WAY1_DATA2;
    volatile    uint32_t    SET207_WAY1_DATA3;
    volatile    uint32_t    SET208_WAY0_DATA0;
    volatile    uint32_t    SET208_WAY0_DATA1;
    volatile    uint32_t    SET208_WAY0_DATA2;
    volatile    uint32_t    SET208_WAY0_DATA3;
    volatile    uint32_t    SET208_WAY1_DATA0;
    volatile    uint32_t    SET208_WAY1_DATA1;
    volatile    uint32_t    SET208_WAY1_DATA2;
    volatile    uint32_t    SET208_WAY1_DATA3;
    volatile    uint32_t    SET209_WAY0_DATA0;
    volatile    uint32_t    SET209_WAY0_DATA1;
    volatile    uint32_t    SET209_WAY0_DATA2;
    volatile    uint32_t    SET209_WAY0_DATA3;
    volatile    uint32_t    SET209_WAY1_DATA0;
    volatile    uint32_t    SET209_WAY1_DATA1;
    volatile    uint32_t    SET209_WAY1_DATA2;
    volatile    uint32_t    SET209_WAY1_DATA3;
    volatile    uint32_t    SET210_WAY0_DATA0;
    volatile    uint32_t    SET210_WAY0_DATA1;
    volatile    uint32_t    SET210_WAY0_DATA2;
    volatile    uint32_t    SET210_WAY0_DATA3;
    volatile    uint32_t    SET210_WAY1_DATA0;
    volatile    uint32_t    SET210_WAY1_DATA1;
    volatile    uint32_t    SET210_WAY1_DATA2;
    volatile    uint32_t    SET210_WAY1_DATA3;
    volatile    uint32_t    SET211_WAY0_DATA0;
    volatile    uint32_t    SET211_WAY0_DATA1;
    volatile    uint32_t    SET211_WAY0_DATA2;
    volatile    uint32_t    SET211_WAY0_DATA3;
    volatile    uint32_t    SET211_WAY1_DATA0;
    volatile    uint32_t    SET211_WAY1_DATA1;
    volatile    uint32_t    SET211_WAY1_DATA2;
    volatile    uint32_t    SET211_WAY1_DATA3;
    volatile    uint32_t    SET212_WAY0_DATA0;
    volatile    uint32_t    SET212_WAY0_DATA1;
    volatile    uint32_t    SET212_WAY0_DATA2;
    volatile    uint32_t    SET212_WAY0_DATA3;
    volatile    uint32_t    SET212_WAY1_DATA0;
    volatile    uint32_t    SET212_WAY1_DATA1;
    volatile    uint32_t    SET212_WAY1_DATA2;
    volatile    uint32_t    SET212_WAY1_DATA3;
    volatile    uint32_t    SET213_WAY0_DATA0;
    volatile    uint32_t    SET213_WAY0_DATA1;
    volatile    uint32_t    SET213_WAY0_DATA2;
    volatile    uint32_t    SET213_WAY0_DATA3;
    volatile    uint32_t    SET213_WAY1_DATA0;
    volatile    uint32_t    SET213_WAY1_DATA1;
    volatile    uint32_t    SET213_WAY1_DATA2;
    volatile    uint32_t    SET213_WAY1_DATA3;
    volatile    uint32_t    SET214_WAY0_DATA0;
    volatile    uint32_t    SET214_WAY0_DATA1;
    volatile    uint32_t    SET214_WAY0_DATA2;
    volatile    uint32_t    SET214_WAY0_DATA3;
    volatile    uint32_t    SET214_WAY1_DATA0;
    volatile    uint32_t    SET214_WAY1_DATA1;
    volatile    uint32_t    SET214_WAY1_DATA2;
    volatile    uint32_t    SET214_WAY1_DATA3;
    volatile    uint32_t    SET215_WAY0_DATA0;
    volatile    uint32_t    SET215_WAY0_DATA1;
    volatile    uint32_t    SET215_WAY0_DATA2;
    volatile    uint32_t    SET215_WAY0_DATA3;
    volatile    uint32_t    SET215_WAY1_DATA0;
    volatile    uint32_t    SET215_WAY1_DATA1;
    volatile    uint32_t    SET215_WAY1_DATA2;
    volatile    uint32_t    SET215_WAY1_DATA3;
    volatile    uint32_t    SET216_WAY0_DATA0;
    volatile    uint32_t    SET216_WAY0_DATA1;
    volatile    uint32_t    SET216_WAY0_DATA2;
    volatile    uint32_t    SET216_WAY0_DATA3;
    volatile    uint32_t    SET216_WAY1_DATA0;
    volatile    uint32_t    SET216_WAY1_DATA1;
    volatile    uint32_t    SET216_WAY1_DATA2;
    volatile    uint32_t    SET216_WAY1_DATA3;
    volatile    uint32_t    SET217_WAY0_DATA0;
    volatile    uint32_t    SET217_WAY0_DATA1;
    volatile    uint32_t    SET217_WAY0_DATA2;
    volatile    uint32_t    SET217_WAY0_DATA3;
    volatile    uint32_t    SET217_WAY1_DATA0;
    volatile    uint32_t    SET217_WAY1_DATA1;
    volatile    uint32_t    SET217_WAY1_DATA2;
    volatile    uint32_t    SET217_WAY1_DATA3;
    volatile    uint32_t    SET218_WAY0_DATA0;
    volatile    uint32_t    SET218_WAY0_DATA1;
    volatile    uint32_t    SET218_WAY0_DATA2;
    volatile    uint32_t    SET218_WAY0_DATA3;
    volatile    uint32_t    SET218_WAY1_DATA0;
    volatile    uint32_t    SET218_WAY1_DATA1;
    volatile    uint32_t    SET218_WAY1_DATA2;
    volatile    uint32_t    SET218_WAY1_DATA3;
    volatile    uint32_t    SET219_WAY0_DATA0;
    volatile    uint32_t    SET219_WAY0_DATA1;
    volatile    uint32_t    SET219_WAY0_DATA2;
    volatile    uint32_t    SET219_WAY0_DATA3;
    volatile    uint32_t    SET219_WAY1_DATA0;
    volatile    uint32_t    SET219_WAY1_DATA1;
    volatile    uint32_t    SET219_WAY1_DATA2;
    volatile    uint32_t    SET219_WAY1_DATA3;
    volatile    uint32_t    SET220_WAY0_DATA0;
    volatile    uint32_t    SET220_WAY0_DATA1;
    volatile    uint32_t    SET220_WAY0_DATA2;
    volatile    uint32_t    SET220_WAY0_DATA3;
    volatile    uint32_t    SET220_WAY1_DATA0;
    volatile    uint32_t    SET220_WAY1_DATA1;
    volatile    uint32_t    SET220_WAY1_DATA2;
    volatile    uint32_t    SET220_WAY1_DATA3;
    volatile    uint32_t    SET221_WAY0_DATA0;
    volatile    uint32_t    SET221_WAY0_DATA1;
    volatile    uint32_t    SET221_WAY0_DATA2;
    volatile    uint32_t    SET221_WAY0_DATA3;
    volatile    uint32_t    SET221_WAY1_DATA0;
    volatile    uint32_t    SET221_WAY1_DATA1;
    volatile    uint32_t    SET221_WAY1_DATA2;
    volatile    uint32_t    SET221_WAY1_DATA3;
    volatile    uint32_t    SET222_WAY0_DATA0;
    volatile    uint32_t    SET222_WAY0_DATA1;
    volatile    uint32_t    SET222_WAY0_DATA2;
    volatile    uint32_t    SET222_WAY0_DATA3;
    volatile    uint32_t    SET222_WAY1_DATA0;
    volatile    uint32_t    SET222_WAY1_DATA1;
    volatile    uint32_t    SET222_WAY1_DATA2;
    volatile    uint32_t    SET222_WAY1_DATA3;
    volatile    uint32_t    SET223_WAY0_DATA0;
    volatile    uint32_t    SET223_WAY0_DATA1;
    volatile    uint32_t    SET223_WAY0_DATA2;
    volatile    uint32_t    SET223_WAY0_DATA3;
    volatile    uint32_t    SET223_WAY1_DATA0;
    volatile    uint32_t    SET223_WAY1_DATA1;
    volatile    uint32_t    SET223_WAY1_DATA2;
    volatile    uint32_t    SET223_WAY1_DATA3;
    volatile    uint32_t    SET224_WAY0_DATA0;
    volatile    uint32_t    SET224_WAY0_DATA1;
    volatile    uint32_t    SET224_WAY0_DATA2;
    volatile    uint32_t    SET224_WAY0_DATA3;
    volatile    uint32_t    SET224_WAY1_DATA0;
    volatile    uint32_t    SET224_WAY1_DATA1;
    volatile    uint32_t    SET224_WAY1_DATA2;
    volatile    uint32_t    SET224_WAY1_DATA3;
    volatile    uint32_t    SET225_WAY0_DATA0;
    volatile    uint32_t    SET225_WAY0_DATA1;
    volatile    uint32_t    SET225_WAY0_DATA2;
    volatile    uint32_t    SET225_WAY0_DATA3;
    volatile    uint32_t    SET225_WAY1_DATA0;
    volatile    uint32_t    SET225_WAY1_DATA1;
    volatile    uint32_t    SET225_WAY1_DATA2;
    volatile    uint32_t    SET225_WAY1_DATA3;
    volatile    uint32_t    SET226_WAY0_DATA0;
    volatile    uint32_t    SET226_WAY0_DATA1;
    volatile    uint32_t    SET226_WAY0_DATA2;
    volatile    uint32_t    SET226_WAY0_DATA3;
    volatile    uint32_t    SET226_WAY1_DATA0;
    volatile    uint32_t    SET226_WAY1_DATA1;
    volatile    uint32_t    SET226_WAY1_DATA2;
    volatile    uint32_t    SET226_WAY1_DATA3;
    volatile    uint32_t    SET227_WAY0_DATA0;
    volatile    uint32_t    SET227_WAY0_DATA1;
    volatile    uint32_t    SET227_WAY0_DATA2;
    volatile    uint32_t    SET227_WAY0_DATA3;
    volatile    uint32_t    SET227_WAY1_DATA0;
    volatile    uint32_t    SET227_WAY1_DATA1;
    volatile    uint32_t    SET227_WAY1_DATA2;
    volatile    uint32_t    SET227_WAY1_DATA3;
    volatile    uint32_t    SET228_WAY0_DATA0;
    volatile    uint32_t    SET228_WAY0_DATA1;
    volatile    uint32_t    SET228_WAY0_DATA2;
    volatile    uint32_t    SET228_WAY0_DATA3;
    volatile    uint32_t    SET228_WAY1_DATA0;
    volatile    uint32_t    SET228_WAY1_DATA1;
    volatile    uint32_t    SET228_WAY1_DATA2;
    volatile    uint32_t    SET228_WAY1_DATA3;
    volatile    uint32_t    SET229_WAY0_DATA0;
    volatile    uint32_t    SET229_WAY0_DATA1;
    volatile    uint32_t    SET229_WAY0_DATA2;
    volatile    uint32_t    SET229_WAY0_DATA3;
    volatile    uint32_t    SET229_WAY1_DATA0;
    volatile    uint32_t    SET229_WAY1_DATA1;
    volatile    uint32_t    SET229_WAY1_DATA2;
    volatile    uint32_t    SET229_WAY1_DATA3;
    volatile    uint32_t    SET230_WAY0_DATA0;
    volatile    uint32_t    SET230_WAY0_DATA1;
    volatile    uint32_t    SET230_WAY0_DATA2;
    volatile    uint32_t    SET230_WAY0_DATA3;
    volatile    uint32_t    SET230_WAY1_DATA0;
    volatile    uint32_t    SET230_WAY1_DATA1;
    volatile    uint32_t    SET230_WAY1_DATA2;
    volatile    uint32_t    SET230_WAY1_DATA3;
    volatile    uint32_t    SET231_WAY0_DATA0;
    volatile    uint32_t    SET231_WAY0_DATA1;
    volatile    uint32_t    SET231_WAY0_DATA2;
    volatile    uint32_t    SET231_WAY0_DATA3;
    volatile    uint32_t    SET231_WAY1_DATA0;
    volatile    uint32_t    SET231_WAY1_DATA1;
    volatile    uint32_t    SET231_WAY1_DATA2;
    volatile    uint32_t    SET231_WAY1_DATA3;
    volatile    uint32_t    SET232_WAY0_DATA0;
    volatile    uint32_t    SET232_WAY0_DATA1;
    volatile    uint32_t    SET232_WAY0_DATA2;
    volatile    uint32_t    SET232_WAY0_DATA3;
    volatile    uint32_t    SET232_WAY1_DATA0;
    volatile    uint32_t    SET232_WAY1_DATA1;
    volatile    uint32_t    SET232_WAY1_DATA2;
    volatile    uint32_t    SET232_WAY1_DATA3;
    volatile    uint32_t    SET233_WAY0_DATA0;
    volatile    uint32_t    SET233_WAY0_DATA1;
    volatile    uint32_t    SET233_WAY0_DATA2;
    volatile    uint32_t    SET233_WAY0_DATA3;
    volatile    uint32_t    SET233_WAY1_DATA0;
    volatile    uint32_t    SET233_WAY1_DATA1;
    volatile    uint32_t    SET233_WAY1_DATA2;
    volatile    uint32_t    SET233_WAY1_DATA3;
    volatile    uint32_t    SET234_WAY0_DATA0;
    volatile    uint32_t    SET234_WAY0_DATA1;
    volatile    uint32_t    SET234_WAY0_DATA2;
    volatile    uint32_t    SET234_WAY0_DATA3;
    volatile    uint32_t    SET234_WAY1_DATA0;
    volatile    uint32_t    SET234_WAY1_DATA1;
    volatile    uint32_t    SET234_WAY1_DATA2;
    volatile    uint32_t    SET234_WAY1_DATA3;
    volatile    uint32_t    SET235_WAY0_DATA0;
    volatile    uint32_t    SET235_WAY0_DATA1;
    volatile    uint32_t    SET235_WAY0_DATA2;
    volatile    uint32_t    SET235_WAY0_DATA3;
    volatile    uint32_t    SET235_WAY1_DATA0;
    volatile    uint32_t    SET235_WAY1_DATA1;
    volatile    uint32_t    SET235_WAY1_DATA2;
    volatile    uint32_t    SET235_WAY1_DATA3;
    volatile    uint32_t    SET236_WAY0_DATA0;
    volatile    uint32_t    SET236_WAY0_DATA1;
    volatile    uint32_t    SET236_WAY0_DATA2;
    volatile    uint32_t    SET236_WAY0_DATA3;
    volatile    uint32_t    SET236_WAY1_DATA0;
    volatile    uint32_t    SET236_WAY1_DATA1;
    volatile    uint32_t    SET236_WAY1_DATA2;
    volatile    uint32_t    SET236_WAY1_DATA3;
    volatile    uint32_t    SET237_WAY0_DATA0;
    volatile    uint32_t    SET237_WAY0_DATA1;
    volatile    uint32_t    SET237_WAY0_DATA2;
    volatile    uint32_t    SET237_WAY0_DATA3;
    volatile    uint32_t    SET237_WAY1_DATA0;
    volatile    uint32_t    SET237_WAY1_DATA1;
    volatile    uint32_t    SET237_WAY1_DATA2;
    volatile    uint32_t    SET237_WAY1_DATA3;
    volatile    uint32_t    SET238_WAY0_DATA0;
    volatile    uint32_t    SET238_WAY0_DATA1;
    volatile    uint32_t    SET238_WAY0_DATA2;
    volatile    uint32_t    SET238_WAY0_DATA3;
    volatile    uint32_t    SET238_WAY1_DATA0;
    volatile    uint32_t    SET238_WAY1_DATA1;
    volatile    uint32_t    SET238_WAY1_DATA2;
    volatile    uint32_t    SET238_WAY1_DATA3;
    volatile    uint32_t    SET239_WAY0_DATA0;
    volatile    uint32_t    SET239_WAY0_DATA1;
    volatile    uint32_t    SET239_WAY0_DATA2;
    volatile    uint32_t    SET239_WAY0_DATA3;
    volatile    uint32_t    SET239_WAY1_DATA0;
    volatile    uint32_t    SET239_WAY1_DATA1;
    volatile    uint32_t    SET239_WAY1_DATA2;
    volatile    uint32_t    SET239_WAY1_DATA3;
    volatile    uint32_t    SET240_WAY0_DATA0;
    volatile    uint32_t    SET240_WAY0_DATA1;
    volatile    uint32_t    SET240_WAY0_DATA2;
    volatile    uint32_t    SET240_WAY0_DATA3;
    volatile    uint32_t    SET240_WAY1_DATA0;
    volatile    uint32_t    SET240_WAY1_DATA1;
    volatile    uint32_t    SET240_WAY1_DATA2;
    volatile    uint32_t    SET240_WAY1_DATA3;
    volatile    uint32_t    SET241_WAY0_DATA0;
    volatile    uint32_t    SET241_WAY0_DATA1;
    volatile    uint32_t    SET241_WAY0_DATA2;
    volatile    uint32_t    SET241_WAY0_DATA3;
    volatile    uint32_t    SET241_WAY1_DATA0;
    volatile    uint32_t    SET241_WAY1_DATA1;
    volatile    uint32_t    SET241_WAY1_DATA2;
    volatile    uint32_t    SET241_WAY1_DATA3;
    volatile    uint32_t    SET242_WAY0_DATA0;
    volatile    uint32_t    SET242_WAY0_DATA1;
    volatile    uint32_t    SET242_WAY0_DATA2;
    volatile    uint32_t    SET242_WAY0_DATA3;
    volatile    uint32_t    SET242_WAY1_DATA0;
    volatile    uint32_t    SET242_WAY1_DATA1;
    volatile    uint32_t    SET242_WAY1_DATA2;
    volatile    uint32_t    SET242_WAY1_DATA3;
    volatile    uint32_t    SET243_WAY0_DATA0;
    volatile    uint32_t    SET243_WAY0_DATA1;
    volatile    uint32_t    SET243_WAY0_DATA2;
    volatile    uint32_t    SET243_WAY0_DATA3;
    volatile    uint32_t    SET243_WAY1_DATA0;
    volatile    uint32_t    SET243_WAY1_DATA1;
    volatile    uint32_t    SET243_WAY1_DATA2;
    volatile    uint32_t    SET243_WAY1_DATA3;
    volatile    uint32_t    SET244_WAY0_DATA0;
    volatile    uint32_t    SET244_WAY0_DATA1;
    volatile    uint32_t    SET244_WAY0_DATA2;
    volatile    uint32_t    SET244_WAY0_DATA3;
    volatile    uint32_t    SET244_WAY1_DATA0;
    volatile    uint32_t    SET244_WAY1_DATA1;
    volatile    uint32_t    SET244_WAY1_DATA2;
    volatile    uint32_t    SET244_WAY1_DATA3;
    volatile    uint32_t    SET245_WAY0_DATA0;
    volatile    uint32_t    SET245_WAY0_DATA1;
    volatile    uint32_t    SET245_WAY0_DATA2;
    volatile    uint32_t    SET245_WAY0_DATA3;
    volatile    uint32_t    SET245_WAY1_DATA0;
    volatile    uint32_t    SET245_WAY1_DATA1;
    volatile    uint32_t    SET245_WAY1_DATA2;
    volatile    uint32_t    SET245_WAY1_DATA3;
    volatile    uint32_t    SET246_WAY0_DATA0;
    volatile    uint32_t    SET246_WAY0_DATA1;
    volatile    uint32_t    SET246_WAY0_DATA2;
    volatile    uint32_t    SET246_WAY0_DATA3;
    volatile    uint32_t    SET246_WAY1_DATA0;
    volatile    uint32_t    SET246_WAY1_DATA1;
    volatile    uint32_t    SET246_WAY1_DATA2;
    volatile    uint32_t    SET246_WAY1_DATA3;
    volatile    uint32_t    SET247_WAY0_DATA0;
    volatile    uint32_t    SET247_WAY0_DATA1;
    volatile    uint32_t    SET247_WAY0_DATA2;
    volatile    uint32_t    SET247_WAY0_DATA3;
    volatile    uint32_t    SET247_WAY1_DATA0;
    volatile    uint32_t    SET247_WAY1_DATA1;
    volatile    uint32_t    SET247_WAY1_DATA2;
    volatile    uint32_t    SET247_WAY1_DATA3;
    volatile    uint32_t    SET248_WAY0_DATA0;
    volatile    uint32_t    SET248_WAY0_DATA1;
    volatile    uint32_t    SET248_WAY0_DATA2;
    volatile    uint32_t    SET248_WAY0_DATA3;
    volatile    uint32_t    SET248_WAY1_DATA0;
    volatile    uint32_t    SET248_WAY1_DATA1;
    volatile    uint32_t    SET248_WAY1_DATA2;
    volatile    uint32_t    SET248_WAY1_DATA3;
    volatile    uint32_t    SET249_WAY0_DATA0;
    volatile    uint32_t    SET249_WAY0_DATA1;
    volatile    uint32_t    SET249_WAY0_DATA2;
    volatile    uint32_t    SET249_WAY0_DATA3;
    volatile    uint32_t    SET249_WAY1_DATA0;
    volatile    uint32_t    SET249_WAY1_DATA1;
    volatile    uint32_t    SET249_WAY1_DATA2;
    volatile    uint32_t    SET249_WAY1_DATA3;
    volatile    uint32_t    SET250_WAY0_DATA0;
    volatile    uint32_t    SET250_WAY0_DATA1;
    volatile    uint32_t    SET250_WAY0_DATA2;
    volatile    uint32_t    SET250_WAY0_DATA3;
    volatile    uint32_t    SET250_WAY1_DATA0;
    volatile    uint32_t    SET250_WAY1_DATA1;
    volatile    uint32_t    SET250_WAY1_DATA2;
    volatile    uint32_t    SET250_WAY1_DATA3;
    volatile    uint32_t    SET251_WAY0_DATA0;
    volatile    uint32_t    SET251_WAY0_DATA1;
    volatile    uint32_t    SET251_WAY0_DATA2;
    volatile    uint32_t    SET251_WAY0_DATA3;
    volatile    uint32_t    SET251_WAY1_DATA0;
    volatile    uint32_t    SET251_WAY1_DATA1;
    volatile    uint32_t    SET251_WAY1_DATA2;
    volatile    uint32_t    SET251_WAY1_DATA3;
    volatile    uint32_t    SET252_WAY0_DATA0;
    volatile    uint32_t    SET252_WAY0_DATA1;
    volatile    uint32_t    SET252_WAY0_DATA2;
    volatile    uint32_t    SET252_WAY0_DATA3;
    volatile    uint32_t    SET252_WAY1_DATA0;
    volatile    uint32_t    SET252_WAY1_DATA1;
    volatile    uint32_t    SET252_WAY1_DATA2;
    volatile    uint32_t    SET252_WAY1_DATA3;
    volatile    uint32_t    SET253_WAY0_DATA0;
    volatile    uint32_t    SET253_WAY0_DATA1;
    volatile    uint32_t    SET253_WAY0_DATA2;
    volatile    uint32_t    SET253_WAY0_DATA3;
    volatile    uint32_t    SET253_WAY1_DATA0;
    volatile    uint32_t    SET253_WAY1_DATA1;
    volatile    uint32_t    SET253_WAY1_DATA2;
    volatile    uint32_t    SET253_WAY1_DATA3;
    volatile    uint32_t    SET254_WAY0_DATA0;
    volatile    uint32_t    SET254_WAY0_DATA1;
    volatile    uint32_t    SET254_WAY0_DATA2;
    volatile    uint32_t    SET254_WAY0_DATA3;
    volatile    uint32_t    SET254_WAY1_DATA0;
    volatile    uint32_t    SET254_WAY1_DATA1;
    volatile    uint32_t    SET254_WAY1_DATA2;
    volatile    uint32_t    SET254_WAY1_DATA3;
    volatile    uint32_t    SET255_WAY0_DATA0;
    volatile    uint32_t    SET255_WAY0_DATA1;
    volatile    uint32_t    SET255_WAY0_DATA2;
    volatile    uint32_t    SET255_WAY0_DATA3;
    volatile    uint32_t    SET255_WAY1_DATA0;
    volatile    uint32_t    SET255_WAY1_DATA1;
    volatile    uint32_t    SET255_WAY1_DATA2;
    volatile    uint32_t    SET255_WAY1_DATA3;
} CACHEDATA_TypeDef;

#ifdef __cplusplus
#define CACHEDATA_S reinterpret_cast<CACHEDATA_TypeDef *>(0x00F00000U)

#else
#define CACHEDATA_S ((CACHEDATA_TypeDef *)0x00F00000U)
#endif

// DATA0 Configuration

#define CACHEDATA_SET_WAY_DATA0_DATA    (0xFFFFFFFFU<<0)
#define CACHEDATA_SET_WAY_DATA0_DATA_0  (0x1U<<0)

// DATA1 Configuration

#define CACHEDATA_SET_WAY_DATA1_DATA    (0xFFFFFFFFU<<0)
#define CACHEDATA_SET_WAY_DATA1_DATA_0  (0x1U<<0)

// DATA2 Configuration

#define CACHEDATA_SET_WAY_DATA2_DATA    (0xFFFFFFFFU<<0)
#define CACHEDATA_SET_WAY_DATA2_DATA_0  (0x1U<<0)

// DATA3 Configuration

#define CACHEDATA_SET_WAY_DATA3_DATA    (0xFFFFFFFFU<<0)
#define CACHEDATA_SET_WAY_DATA3_DATA_0  (0x1U<<0)
